[{"Id":5,"Name":"Build WyCo","Address":"2 S. 14th St","ZipCode":"66102","Phone":"9133427580","Email":"info@buildwyco.org","ContactName":"Rebekah Swank","Mission":"Build WyCo\u0027s mission is to invest in the power of our neighbors to build communities that thrive for generations.","Description":"For 25 years, Build WyCo has been investing in the power of our neighbors to build communities that thrive for generations. Our vision is an abundant, inclusive, and welcoming Kansas City, Kansas where anyone can feel at a home in a neighborhood they love.\n\nWe build homes: We build and renovate high-quality homes to revitalize neighborhoods, increase investment in our community\u0027s vital infrastructure, and create lasting assets for families.\nWe open opportunities: We enable families to achieve, preserve, and sustain their dream of homeownership by offering free and low-cost housing counseling, financial education, homeownership loans, and purchase assistance.\nWe strengthen community: We bring neighbors together by investing in community spaces like art studios, community gardens, and parks.","LinkVolunteer":"https://buildwyco.org/get-involved/volunteer/","LinkWebsite":"https://buildwyco.org/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/5.png","City":"Kansas City","State":"KS","Lat":39.10419845581055,"Lng":-94.6448974609375},{"Id":6,"Name":"Mission Adelante","Address":"22 South 18th Street","ZipCode":"66102","Phone":"9132816274","Email":"alexr@missionadelante.org","ContactName":"Alex Ruybalid","Mission":"To make disciples by serving, sharing life, and sharing Jesus with people from all places.","Description":"We envision a growing multicultural community of disciples making disciples, where immigrants and others are thriving and using our gifts together to transform our neighborhood and the world for the glory of Jesus Christ.","LinkVolunteer":"http://missionadelante.org/serve","LinkWebsite":"http://missionadelante.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/6.png","City":"Kansas City","State":"KS","Lat":39.10499954223633,"Lng":-94.64969635009766},{"Id":7,"Name":"Healing House","Address":"4505 St John Ave","ZipCode":"64123","Phone":"8169207181","Email":"info@healinghouseinc.net","ContactName":"","Mission":"Healing House, Inc. is a non-profit, faith-based substance abuse recovery organization. We work in the Kansas City metropolitan area to provide safe and stable homes with opportunities for spiritual and personal growth along with purposeful guidance and support. We serve both men and women who are committed to overcoming their addiction and becoming responsible, productive, drug and alcohol free members of our community. Healing House provides recovery housing to nearly 200 individuals every day in our thirteen private homes and two apartment buildings.","Description":"Healing House has provided recovery housing and support for people overcoming substance use disorders since 2001.   We currently have 7 women\u0027s homes and 6 men\u0027s homes with an additional women\u0027s homes set to open in 2020.  We also have 2 apartment complexes for families with small children and for residents who are further along in their recovery journey.  \n \nAs a recovery housing provider, we have funding to assist new residents for the first few months to give them time to stabilize their lives. During that time we have day time classes and meetings that focus on learning to live clean and sober, along with life skills and employment coaching. \n \nWe have a full-time employment specialist who works with residents to find employment within about 60 days. Moving forward, they then move to our advanced houses and pay their own way. There is no limit to how long a person can stay with us. They are welcome to live here as long as they feel they need to.","LinkVolunteer":"https://www.healinghousekc.org/volunteer-form/","LinkWebsite":"https://www.healinghousekc.org/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/7.png","City":"Kansas City","State":"MO","Lat":39.11249923706055,"Lng":-94.52860260009766},{"Id":8,"Name":"EarlystART","Address":"2008 East 12th Street","ZipCode":"64127","Phone":"8169945432","Email":"mariah.roady@uicskc.org","ContactName":"Mariah Roady","Mission":"Building bridges. Inspiring minds. Impacting futures.","Description":"EarlystART (formerly United Inner City Services) is a multi-service, community-based agency serving Kansas City, Missouri since 1967. Over the years, EarlystART has addressed the issues of the urban core employment, emergency assistance, housing, violence intervention, early childhood education and youth services.\n\nEarlystART serves as a neighborhood anchor, providing a safe, warm, inviting site for a variety of social services, early education programs, community arts programs, and neighborhood outreach.\n\nWe operate three early childhood education centers and offer a distinctive, creative curriculum and a commitment to a highly trained faculty. UICS-St. Mark Center, UICS-Metro Center, and UICS-North Center function as the heart and signature outreach of UICS and are recognized as Kansas City’s leading early learning programs. Our Centers serve nearly 300 infants and toddlers, and pre-k students as well as their families and caregivers.\n\nThe Arts are an integral component at UICS. We encourage individuality and support exploration. We inspire students to march to their own beats and do what works for them. We cultivate open-mindedness and creativity in all that we do. UICS is distinguished for its arts-based curriculum which not only enhances students’ developmental progress, but also enriches their lives through exposure to arts and cultural experiences.","LinkVolunteer":"https://uicskc.org/invest/volunteer/","LinkWebsite":"https://earlystartkc.org/","LinkWishlist":"https://a.co/8RPVNQc","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/8.jpg","City":"Kansas City","State":"MO","Lat":39.099300384521484,"Lng":-94.55819702148438},{"Id":9,"Name":"Great Plains SPCA","Address":"5424 Antioch Drive","ZipCode":"66202","Phone":"9138317722","Email":"info@greatplainsspca.org","ContactName":"Keegan Prentice","Mission":"Our mission is to drive change in our community through innovative programs that promote adoption, outreach and a better life for pets and the people who love them.","Description":"As an independent 501(c)(3) nonprofit, our lifesaving services for animals can only be provided because of your generosity and commitment to our mission. Great Plains SPCA exists solely because of our caring Kansas City community and gracious donors like you!","LinkVolunteer":"https://www.greatplainsspca.org/volunteer/","LinkWebsite":"https://www.greatplainsspca.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/25R80BAQ4EE6G/ref=nav_wishlist_lists_1?_encoding=UTF8\u0026type=wishlist","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/9.png","City":"Merriam","State":"KS","Lat":39.030399322509766,"Lng":-94.68830108642578},{"Id":11,"Name":"Green Works in Kansas City","Address":"607 East 31st Street","ZipCode":"64109","Phone":"8163048400","Email":"info@GreenWorksKC.org","ContactName":"Kate Corwin","Mission":"Since 2007 we have been empowering Kansas City\u0027s future leaders  to care for our environment, contribute to our economy, and create healthy communities.","Description":"We offer environmental education for elementary and middle school students and career-readiness/leadership/entrepreneurship/volunteer programs for high school students. \n\nShop our retail storefront and support our youth programs. Due to COVID, our store is currently open by appointment until spring of 2021. Contact info@greenworkskc.org. Donations of high-quality used items welcomed! \n\nAddress - 605 East 31st Street, Kansas City, MO 64109","LinkVolunteer":"https://www.greenworkskc.org/support/","LinkWebsite":"https://www.greenworkskc.org/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/11.jpg","City":" Kansas City","State":"MO","Lat":39.07059860229492,"Lng":-94.57710266113281},{"Id":12,"Name":"Regal Health and Wellness, Inc.","Address":"3210 Michigan Avenue, Suite 161","ZipCode":"64109","Phone":"9139720791","Email":"docjsingle1@yahoo.com","ContactName":"Juanita Singleton","Mission":"We are a personal and professional development outreach hub, with emphasis on eliminating poverty and elevating women and their families, through the 3E programs (Education, Empowerment, and Entrepreneurship). ","Description":"Regal Health and Wellness will assist women in under-served communities transform from an area of poverty to pow ‘her, by focusing on eliminating disparities that may be a hindrance in helping women be successful personally and professionally. Whether it be housing, food, clothing, medical/dental, or transportation. We will assist these women in being and feeling Healthy, Beautiful, and Successful.\n\nIn addition, Regal Health and Wellness, Inc. will assist women in developing their careers in the healthcare field; such as Nurse\u0027s Aides, Home Care Assistants, and Personal Care Aides, with programming, workshops, seminars, life coaching, community outreach, and other initiatives.\n\nStatistics show that Nurse Assistants, Home Care Aides, and Personal Care Attendant- Careers are on the rise as the \u0022Baby Boomer\u0022 generation ages, and Seniors are remaining in their homes, and receiving In-Home Health Care as opposed to entering a Skilled Nursing facility. \n\nBy assisting women who are the (\u0022Primary\u0022 Care givers in their family) with training in the Health Care Careers, Regal Home Care will also answer the call for eliminating \u0022Social Isolation\u0022 of the Senior Aging Population.","LinkVolunteer":"http://regalhealthandwellness4you.org","LinkWebsite":"https://regalhealthandwellness4you.org","LinkWishlist":"https://a.co/0Tj8R9L","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/12.jpg","City":"Kansas City","State":"MO","Lat":39.06769943237305,"Lng":-94.5614013671875},{"Id":14,"Name":"The ShareWaves Foundation","Address":"6721 West 121st St","ZipCode":"66209","Phone":"9132199435","Email":"info@sharewavesfoundation.org","ContactName":"William Brandmeyer","Mission":"Our mission is to advance opportunities for all kids to experience the life-enriching \u0022power of sports\u0022.","Description":"The ShareWaves Foundation, Powered by Sports Radio 810WHB, is a new 501c3 tax-exempt public charity working to give kids greater access to sports.","LinkVolunteer":"","LinkWebsite":"http://www.sharewavesfoundation.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/14.png","City":"Overland Park","State":"KS","Lat":38.90739822387695,"Lng":-94.66480255126953},{"Id":17,"Name":"Catholic Charities of Northeast Kansas","Address":"9720 W. 87th Street","ZipCode":"66212","Phone":"9139068984","Email":"kfeatherston@catholiccharitiesks.org","ContactName":"Kasey Featherston","Mission":"We serve our neighbors, of all faiths, through Help, Hope, and Hospitality.","Description":"Catholic Charities’ Refugee and Immigration Services department has over 30 years of experience delivering assistance to refugees and immigrants in the state of Kansas and is the only resettlement site in Wyandotte and Johnson Counties. ","LinkVolunteer":"https://catholiccharitiesks.org/covid-volunteering/","LinkWebsite":"https://catholiccharitiesks.org/refugees/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/17.jpg","City":"Overland Park, KS","State":"KS","Lat":38.972198486328125,"Lng":-94.6989974975586},{"Id":18,"Name":"Emmanuel Family and Child Development Center","Address":"4736 Prospect Avenue","ZipCode":"64130","Phone":"8169213164","Email":"info@emmanuelschildc","ContactName":"Colette Black","Mission":"The mission of Emmanuel Family and Child Development Center is to ensure that all children living in poverty have access to a high quality early educational learning environment, which stimulates the physical, social, emotional, and intellectual development of children and ensures school readiness, in addition to providing supportive services to families.","Description":"We are committed to providing outstanding early childcare services in a safe, loving, and educational environment for children in poverty through empowering their families through advocacy, emergency aid, and education.","LinkVolunteer":"http://www.emmanuelschildcare.org","LinkWebsite":"http://www.emmanuelschildcare.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/18.jpg","City":"Kansas City","State":"MO","Lat":39.03969955444336,"Lng":-94.55460357666016},{"Id":20,"Name":"Big Brothers Big Sisters","Address":"1709 Walnut Street","ZipCode":"64108","Phone":"8165615269","Email":"info@bbbskc.org","ContactName":"Kristi Hutchison","Mission":"Big Brothers Big Sisters Kansas City works to clear the path to a child’s biggest possible future by matching them with a caring, adult mentor in a one-to-one friendship. “Bigs” help “Littles” ignite, empower and defend their potential by standing with them.","Description":"“Bigs” help “Littles” ignite, empower and defend their potential by standing with them. Last year, 100% of the Senior Littles graduated high school, 83% reported improved self esteem and 71% reported improved grades since being matched.","LinkVolunteer":"www.bbbskc.org/beabig","LinkWebsite":"https://www.bbbskc.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/20.jpg","City":"Kansas City","State":"MO","Lat":39.092899322509766,"Lng":-94.58209991455078},{"Id":21,"Name":"The Single MOM KC Clothed With Dignity Boutique","Address":"9925 W 88th St","ZipCode":"66212","Phone":"8163927341","Email":"volunteer@thesinglemomkc.org","ContactName":"","Mission":"The Single MOM KC is a ministry of hospitality dedicated to the restoration and healing of single-mother families. By offering a safe, warm environment at meetings and events, we seek to draw single mothers into relationship with God and with others.","Description":"The Single Mom KC is a Christian organization that provides programs and resources to bring hope and courage to single moms as they are equipped emotionally and spiritually. In addition, The Single Mom KC sponsors the Clothed With Dignity Boutique, a used clothing and accessories shop where single moms can shop for themselves for free.","LinkVolunteer":"https://www.thesinglemomkc.org/volunteer.html","LinkWebsite":"http://www.thesinglemomkc.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/21.png","City":"Overland Park","State":"KS","Lat":38.969398498535156,"Lng":-94.70130157470703},{"Id":22,"Name":"Turn the Page KC","Address":"4049 Pennsylvania, Suite 301","ZipCode":"64111","Phone":"8164232596","Email":"kdroege@turnthepagekc.org","ContactName":"Dr. Kristin Droege","Mission":"The mission of Turn the Page KC is to mobilize the community to achieve reading proficiency at grade level or above for all third graders in Kansas City, Missouri. Turn the Page KC was founded by Mayor Sly James in 2011 as an initiative to raise the reading proficiency of third graders, which at the time was only 33%. ","Description":"If a student cannot read proficiently by the end of third grade their likeliness of future academic success drops. Reading is the essential tool needed to continually grasp further concepts. \n\nRight now, only about half of all students in Kansas City, MO are reading at grade level or above by the end of third grade. Turn the Page KC is addressing this by convening our community around this urgent issue. \n\nSince Turn the Page KC was founded in 2011, the number of 3rd graders reading at grade-level and above has increased every year, enrollment in academic summer programs has quadrupled, and chronic student absenteeism has dropped 4%. \n\nAs a community, we have made progress, but there is still work to be done to ensure that every student can read proficiently by the end of 3rd grade and have a chance at a successful and productive future.","LinkVolunteer":"https://turnthepagekc.org/volunteer","LinkWebsite":"http://www.turnthepagekc.org","LinkWishlist":"https://a.co/iy9MAhL","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/22.png","City":"Kansas City","State":"MO","Lat":39.05350112915039,"Lng":-94.59159851074219},{"Id":23,"Name":"Avenue of Life","Address":"500 North 7th Street Trafficway","ZipCode":"66101","Phone":"8167877118","Email":"kim.bryan@avenueoflife.org","ContactName":"Kim Bryan","Mission":"Avenue of Life\u0027s  mission is our commitment to equip and mobilize the community.  ","Description":"Our goal is to facilitate the journey from hand-outs (emergency relief) in crisis, to hand-ups (individual betterment) for those ready to rise above their circumstances, to hand-offs (community development) to indigenous leaders of a transformed community.","LinkVolunteer":"https://www.avenueoflife.org/volunteer.html","LinkWebsite":"https://www.avenueoflife.org/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/23.png","City":"Kansas City","State":"KS","Lat":39.11109924316406,"Lng":-94.62740325927734},{"Id":24,"Name":"The Prospect Urban Eatery","Address":"1710 Paseo Boulevard","ZipCode":"64108","Phone":"8162870389","Email":"info@theprospectkc.org","ContactName":"Shanita McAfee-Bryant","Mission":"The Prospect KC is a nonprofit organization that boosts the prospects of under-resourced individuals, with education in healthy eating and cooking, professional culinary training, and real-world finance and entrepreneurship. From opening a first checking account to opening a restaurant, our wrap-around services set our clients on a path to a good living wage and a fulfilling career.","Description":"Our food social service enterprise, The Prospect: An Urban Eatery, will be the ground-breaking organization that will decrease the statistics of minority unemployment, unsuccessful business developments, and social inequality.  We are privileged to have initiated a professional partnership with Catalyst Kitchens, an existing food social service enterprise. Catalyst Kitchens exemplifies the outreach and endeavors and goal of The Prospect: An Urban Eatery. From community outreaches, business adoption to entrepreneurship opportunities, our projects will collaboratively be a leading force in diversity, equity, and inclusion.  \n\nWith Catalyst Kitchens guidance and mentorship, our business will reach larger geographical areas. This proposed project started with the outreach over 25 years ago through FareStart, a collaborative program that offers education and employment opportunities to local food establishments and communities. Since the initiation of the programs in Seattle, Catalyst Kitchens has successfully launched 56 other programs and helped over 100 organizations develop thriving food social service enterprises. \n\nThe initiatives of the programs in the enterprises implemented practical work and life skills learned through apprenticeships, which provided direct employment opportunities for the graduates of the programs. That initiative is a firsthand account of equality and inclusion in an under-resourced- which is the primary goal of The Prospect. As we adopt aspiring entrepreneurs into our program, educate, and employ them, we hope that the skills and business solutions obtained will prepare them for solo entrepreneurship.","LinkVolunteer":"https://www.theprospectkc.org/take-action","LinkWebsite":"https://www.theprospectkc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2B4VDLFWPRSXO?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/24.png","City":"Kansas City","State":"MO","Lat":39.09260177612305,"Lng":-94.56520080566406},{"Id":25,"Name":"ScrapsKC","Address":"3269 Roanoke Road","ZipCode":"64111","Phone":"8165224305","Email":"brenda@scrapskc.org","ContactName":"Brenda Mott","Mission":"Our work transforms our environment, enhances learning and renews the homeless. ","Description":"ScrapsKC is a non-profit creative reuse center located in Midtown. Our goal is to divert creative materials from the landfill and transform them into something of value. We accept arts and crafts materials, textiles, school and office, unique and colorful miscellaneous items and more! The items are resold in our store and the revenue generated allows us to continue to divert more materials from the landfill, educate on issues focused on our mission, provide free and inexpensive materials to teachers and care for the homeless.\n\nOur shop is open to the public. Artist, designers, teachers, families, do-it-yourselfers, makers and many other community members enjoy coming into Scraps to find items for their imagined creations.\n\nThe homeless volunteer in our shop and in return receive food and supplies to survive on the street.\n\nBe sure to visit our Accepted Donations page before your donate.\n\nWe look forward to your visit to ScrapsKC.","LinkVolunteer":"https://docs.google.com/forms/d/1S1yWLbnOy1l9x6kGkBevMBic0Y_9gqrDJCBzot5MO6s/edit","LinkWebsite":"https://scrapskc.org/","LinkWishlist":"https://www.amazon.com/gp/registry/wishlist/3IFCIERBHYTUU/ref=bnav_topnav_lists_1?","Pickup":false,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/25.jpg","City":"Kansas City","State":"MO","Lat":39.06779861450195,"Lng":-94.60350036621094},{"Id":26,"Name":"Pet Resource Center of Kansas City","Address":"1116 East 59th Street","ZipCode":"64110","Phone":"8163530940","Email":"rlindsey@prckc.org","ContactName":"Rae Lindsey","Mission":"A PROGRAM THAT KEEPS PETS AND PEOPLE TOGETHER","Description":"For nearly 20 years, we’ve provided a powerful set of services that pet owners in the KC metro need to help keep their pets off the streets, out of shelters and in their homes.\n\nThat includes spay/neuter, vaccinations, supplies/resources, support, medical care, education and a shoulder to lean on. When pet owners have nowhere else to go, we’re here to help, leading with love, keeping pets and people where they belong … together.\nWe are happy to receive towels, sheets, newspaper, pill bottles, dog beds, cat and dog food, pet toys, etc.","LinkVolunteer":"https://prckc.galaxydigital.com/","LinkWebsite":"https://prckc.org/","LinkWishlist":"https://smile.amazon.com/hz/charitylist/ls/2YM7SGWR786U0/ref=smi_ext_lnk_lcl_cl","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/26.png","City":"Kansas City","State":"MO","Lat":39.02009963989258,"Lng":-94.5739974975586},{"Id":27,"Name":"St. Paul\u0027s Episcopal Church of Kansas City, Kansas","Address":"1300 N 18th St","ZipCode":"66102","Phone":"9133213535","Email":"office@stpaulskck.org","ContactName":"","Mission":"","Description":"St. Paul’s in Kansas City, Kansas is an engaging and welcoming community of faith whose mission is to be an inclusive, unifying Center:\nserving our neighbors as the hands and feet of Christ,\nproviding opportunities for worship, fellowship, prayer, and formation,\n\nand, by the power of the Holy Spirit,\n\nmaking new Christian disciples and inspiring spiritual transformation.\n\n \n\nSt Paul en Kansas City, Kansas es una participación y bienvenida\n\na comunidad de fe, cuya misión es ser un inclusivo, unificando Centro:\n\nservir a nuestros vecinos como las manos y los pies de Cristo,\n\nproporcionando oportunidades para adoración, comunión, oración y formación\n\ny, por el poder del Espíritu Santo,\n\nhaciendo discípulos Cristianos nuevos e inspirador transformación espiritual.","LinkVolunteer":"mailto:office@stpaulskck.org","LinkWebsite":"https://www.stpaulskck.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/27.jpg","City":"Kansas City","State":"KS","Lat":39.118900299072266,"Lng":-94.6498031616211},{"Id":112,"Name":"aSTEAM Village","Address":"1600 The Paseo","ZipCode":"64108","Phone":"8165350939","Email":"info@asteamvillage.org","ContactName":"William Wells","Mission":"Our mission is to inspire students and families to pursue education and career pathways in Science, Technology, Engineering, Arts and Math (STEAM), through community-based project learning and innovative programs.","Description":"aSTEAM Village is a 501(c)3 organization that focuses on engaging students, families, and educators in Science, Technology, Engineering, Arts and Math (STEAM) pathways to facilitate career and education readiness for participation in the 21st Century economies of today and tomorrow.  ","LinkVolunteer":"Email info@asteamvillage.org.","LinkWebsite":"https://www.asteamvillage.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/68K04NCBSQCT?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/112.png","City":"Kansas City","State":"MO","Lat":39.09339904785156,"Lng":-94.56529998779297},{"Id":113,"Name":"Benilde Hall","Address":"3220 E. 23rd Street","ZipCode":"64131","Phone":"8168425836","Email":"kvick@mail.benildehall.org","ContactName":"Kenneth Vick","Mission":"The mission of Benilde Hall is to provide services for treating addiction, mental health, and homelessness so individuals may return to the community as responsible, employed, and permanently housed contributing members of society.","Description":"Benilde Hall provides comprehensive housing and treatment services to low income homeless men with substance use disorder and co-occurring issues. Services include: Housing – Transitional housing services for 100 men and long term independent housing for 12 men. Substance use disorder Program - All clients must participate in a recovery program that includes group counseling, community groups, individual counseling, community service and case management. Services for Persons with Co-occurring Disorders - On-site psychological services for clients with the dual diagnosis of substance use disorder and mental illness include: Dialectical Behavior Approach groups, Individual psychological therapy, Medication program, Assessment and Treatment / Transition Planning - Using a Transition Plan, the counselor and resident can coordinate needed services to meet the resident’s needs. Depending on the unique needs of each resident, necessary services are included in their plan.","LinkVolunteer":"https://www.benildehall.org/how-to-help/volunteer.html","LinkWebsite":"https://www.benildehall.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/1O0WOU89TUE3T/ref=hz_ls_biz_ex?","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/113.png","City":"Kansas City","State":"MO","Lat":39.083099365234375,"Lng":-94.51570129394531},{"Id":114,"Name":"Adelante Thrift","Address":"3720 State Avenue","ZipCode":"66102","Phone":"9134997215","Email":"store@adelantethrift.com","ContactName":"Elizabeth Torres","Mission":"To provide a unique shopping experience, promote job creation and support community transformation through the profits.","Description":"CORE VALUES\n\nLove for neighbor: We believe that God’s call to love our neighbor is at the heart of all His commands and finds a special expression in the way we extend hospitality and exceptional service to people from all places.\n\nGenerosity:  We believe that generosity has the power to transform individual lives and entire communities.  We will be generous and promote generosity with time, talent, and treasure both within and outside our neighborhood.\n\nWork: We believe that God designed work for mankind to enjoy from the beginning of creation.  Work promotes God-given dignity, contributes to the needs of our community, and sustains individuals and families financially.\n\nDeveloping People: We believe that developing individuals to reach their potential in the workplace is a critical part of community transformation.  We will emphasize equipping and empowering people from our community.\n\nPartnership: We believe that the opportunities and challenges in our community are God-sized, and that meeting them will require partnerships and collaboration both inside and outside our neighborhood.\n\nInnovation: We believe that urban business as ministry requires fresh ideas and new approaches.  We will promote a culture of innovation that encourages creative solutions for unique circumstances.","LinkVolunteer":"https://www.adelantethrift.com/volunteer","LinkWebsite":"https://www.adelantethrift.com/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/1O0WOU89TUE3T/ref=hz_ls_biz_ex?","Pickup":true,"Dropoff":true,"Resell":true,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/114.png","City":"Kansas City","State":"KS","Lat":39.117698669433594,"Lng":-94.6720962524414},{"Id":115,"Name":"Melissa\u0027s Second Chances","Address":"11015 West 75th St","ZipCode":"66214","Phone":"9138318970","Email":"shelter@mscrescue.org","ContactName":"Melissa Henderson","Mission":"Melissa\u0027s Second Chances is a non-profit animal shelter that strives to help find homes and refuge for animals in need of a second chance. Located in Shawnee, KS.","Description":"On January 1, 2019, we rescued our first animal – a dog named George Jetson. Since then, we’ve worked our tails off to give as many animals as possible their Second Chance!","LinkVolunteer":"https://www.mscrescue.org/foster/","LinkWebsite":"https://www.mscrescue.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2RU0HG9OFBV0T/","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/115.png","City":"Shawnee","State":"KS","Lat":38.99250030517578,"Lng":-94.7135009765625},{"Id":116,"Name":"One Kansas City Radio","Address":"3218 Gladstone Boulevard","ZipCode":"64123","Phone":"8165350152","Email":"gunard@onekcradio.org","ContactName":"Gunard Polite","Mission":"One Kansas City Radio unites the multicultural voices in the Kansas City Urban Core through programming and community services that entertain, educate, inform and inspire.","Description":"We feature multicultural and multilingual daily programs representing our community in the urban core through a positive, entertaining, and informative format.","LinkVolunteer":"https://www.onekcradio.org/","LinkWebsite":"https://www.onekcradio.org/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/116.png","City":"Kansas City","State":"MO","Lat":39.1161003112793,"Lng":-94.54239654541016},{"Id":117,"Name":"Veronica\u0027s Voice","Address":"PO Box 172472","ZipCode":"66117","Phone":"8164837101","Email":"onlineaccounts@veronicasvoice.org","ContactName":"Lucy Bloom","Mission":"The mission of Veronica’s Voice is to empower women to exit from, prevent the entry into, and to end all demand for commercial sexual exploitation in America through survivor leadership. We accomplish our goals by providing survivors the sanctuary and support needed for deep healing through our residential program; by providing job skill training and employment opportunities through our social enterprise; and through advocacy efforts to challenge and change systems in which women and children are bought and sold.","Description":"Veronica’s Voice was founded in 2000 by Kristy Childs who, during her escape from commercial sexual exploitation, paved a way for her sisters to come along behind her.\n\nThe original dream for Veronica’s Voice was to provide housing and jobs where the women would have the support needed to continue their recovery journey. As we grow our social enterprise, we create sustainability for future growth of our residential program, continuing our mission of survivors paving a way for freedom.\n\nSupport from individuals like you make this dream possible!\n\nLearn how to get involved at www.veronicasvoice.org.","LinkVolunteer":"https://www.veronicasvoice.org/volunteer","LinkWebsite":"https://www.veronicasvoice.org/","LinkWishlist":"https://www.amazon.com/gp/registry/wishlist/32NH2VZVMGRUB?ref%5F=nav%5Fwishlist%5Flists%5F1\u0026pldnSite=1","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/117.png","City":"Kansas City","State":"KS","Lat":39.11349868774414,"Lng":-94.62680053710938},{"Id":118,"Name":"Academie Lafayette","Address":"6903 Oak St.","ZipCode":"64113","Phone":"8163617735","Email":"jwallace@academielafayette.org","ContactName":"Jessica Wallace","Mission":"To educate the children of Kansas City to become globally minded, locally active, critical thinkers through immersion in world languages and cultures.","Description":"Academie Lafayette is a public French immersion charter school serving families living within the KCPS district boundaries.  We are located at three campuses - 2 K-5 campuses at 6903 Oak and 3421 Cherry, and one 6-9 campus (middle school and high school) at 201 E. Armour Blvd.","LinkVolunteer":"","LinkWebsite":"https://www.academielafayette.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/118.png","City":"Kansas City","State":"MO","Lat":39.00230026245117,"Lng":-94.58319854736328},{"Id":119,"Name":"The Rescue Project ","Address":"1121 Orville","ZipCode":"66102","Phone":"9137103959","Email":"jenlynneverhart@gmail.com","ContactName":"Jen Everhart","Mission":"Our mission is to help abandoned, neglected and forgotten animals in Kansas City and surrounding areas.","Description":"We provide basic survival items such as food and dog houses and offer low cost veterinary resources emphasizing the need to spay and neuter. \n\nWe also provide community education/awareness to the public on responsible pet ownership and empower people to make a difference.","LinkVolunteer":"https://therescueproject.net/volunteer/","LinkWebsite":"https://therescueproject.net/","LinkWishlist":"https://bit.ly/TRPNeeds","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/119.png","City":"Kansas City","State":"KS","Lat":39.109500885009766,"Lng":-94.63919830322266},{"Id":122,"Name":"Emerging Builders Inc.","Address":"3125 Gillham Plaza","ZipCode":"64109","Phone":"8169181115","Email":"yahna@emerging-builders.org","ContactName":"Yahna Gibson","Mission":"Emerging Builders (EB) creates opportunities for Women, Black and People of Color in the construction\ntrades through an apprenticeship model, providing tangible workforce skills in tandem with life and\nleadership skills. ","Description":"To ensure the experiential training is meaningful and accessible, Emerging Builders partners with\nconstruction companies on actual project sites in opportunity zones, meaning that for the majority of each\nweek, Builders are placed as employees with companies on project sites in the communities where they live.\nBuilders receive a living wage, structure and support.\nThe apprenticeship series has three major threads:\n1. Life Skills: Mental health support and regular, culturally competent instruction to help build\nstrategies to navigate life circumstances;\n2. Construction Skills: Level 1 Carpentry from the National Center for Construction Education and\nResearch with corresponding skills labs; and\n3. Entrepreneurial Skills: Personal financial literacy training and entrepreneurship training.","LinkVolunteer":"mailto:mailto:admin@emerging-builders.org","LinkWebsite":"https://www.emerging-builders.org","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/122.png","City":"Kansas City","State":"MO","Lat":39.069801330566406,"Lng":-94.57859802246094},{"Id":123,"Name":"Literacy KC","Address":"3036 Troost Avenue","ZipCode":"64109","Phone":"8163339332","Email":"xhankins@literacykc.org","ContactName":"Xavier Hankins","Mission":"To advance literacy within the Kansas City metropolitan area through direct services, advocacy, and collaboration. Our vision is \u0027Literacy For All\u0027.","Description":"Literacy KC offers a welcoming community for adults and families to improve literacy skills and enhance quality of life. With support from volunteers, donors, partners, and the community at large, Literacy KC invests in Kansas City’s greatest asset – our people.\n\nEach term, staff, tutors, volunteers, and instructors build a collaborative learning environment where adult students expand their reading, writing, math, and digital skills. The personalized approach allows students to shape the instruction they receive and delivers a balanced curriculum, leading to improved literacy and life skills.\n\nOur Model\nLiteracy KC is revolutionizing the way adult literacy education is delivered:\n\nINSTRUCTOR LED: Qualified instructors teach relevant, responsive, and level-appropriate curriculum.\n\nTUTOR-DRIVEN: Trained volunteer tutors support the instructors and help meet individual student needs.\n\nSTUDENT-CENTERED: Each student identifies academic and personal goals and instructors design lessons to help them meet these goals","LinkVolunteer":"https://docs.google.com/forms/d/e/1FAIpQLSc4jWkvPpdgslOtvDRrFrnEh9d_uBsdAj6qJokZoq8IR9HNMg/viewform?gxids=7628","LinkWebsite":"https://www.literacykc.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/123.png","City":"Kansas City","State":"MO","Lat":39.07080078125,"Lng":-94.57170104980469},{"Id":124,"Name":"The Sewing Labs","Address":"526 Campbell Street","ZipCode":"64106","Phone":"8163790682","Email":"Director@thesewinglabs.community","ContactName":"Eileen Bobowski","Mission":"The Sewing Labs is an inclusive and welcoming community teaching the legacy of sewing for employment, entrepreneurship, and enrichment.\n","Description":"We focus on individuals who find themselves in at risk situations, such as generational poverty, substance abuse and recovery, formerly incarcerated, immigrants and veterans dealing with PTSD. We welcome everyone.\n\nThe Sewing Labs are huge proponents of upcycling, recycling, re-use and re-purposing. We welcome donations of fabric, notions and gently loved sewing machines. We re-use these materials in our classroom to teach our students. Our students have full access to the fabric and notions and once they complete their courses with us, we work to gift them with a gently used machine to continue to hone their craft at home.\n\nWe hold \u0022Green\u0022 workshops, open to the public, such as un-paper towels, shibori dyeing, mindful mending, reusable face wipes, un-sponges, fabric bowl covers, re-useable produce bags, re-useable grocery totes, re-useable feminine care workshops as well.\n\nFor our Seamstress Training Program class, we need a variety of fabrics for our students to practice their skills on. We are looking for pieces that are at least 1.5 yards long, in cotton blends, twills, or knit fabrics. To confirm that we can use your fabric and to arrange a drop-off, please contact Nina Littrell at (816) 491-8136.","LinkVolunteer":"https://thesewinglabs.community/get-involved/volunteer.html","LinkWebsite":"https://www.thesewinglabs.community","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2UAKNNX3T5YSF?type=wishlist","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/124.jpg","City":"Kansas City","State":"MO","Lat":39.109100341796875,"Lng":-94.57319641113281},{"Id":125,"Name":"Rightfully Sewn","Address":"1800 Wyandotte St, Suite 204","ZipCode":"64108","Phone":"8164918136","Email":"info@rightfullysewn.org","ContactName":"Ellen Kirk","Mission":"Rightfully Sewn will provide seamstress training for individuals so they can thrive in a specialized workforce that will reestablish Kansas City as an epicenter of garment manufacturing, while at the same time, propel Kansas City fashion designers to market so they can supply the burgeoning demand for affordable, high-quality, American-produced garments.","Description":"Rightfully Sewn is an innovative nonprofit that developed its mission to meet the need of individuals for stable, well-paying jobs to secure financial independence, and the need of local fashion industry businesses for skilled seamstresses to expand their operations. We address important economic concerns on both an individual and community-wide level. Through skills training that provides a path to employment and various strategies to foster a well-connected, efficient fashion design and manufacturing community, Rightfully Sewn is laying a path to a contemporary version of Kansas City\u0027s 20th-century golden era of garment design and manufacturing.","LinkVolunteer":"","LinkWebsite":"https://www.rightfullysewn.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/125.jpg","City":"Kansas City","State":"MO","Lat":39.09149932861328,"Lng":-94.5863037109375},{"Id":132,"Name":"Rainbow Center for Communicative Disorders","Address":"900 NW Woods Chapel Rd","ZipCode":"64015","Phone":"8162293869","Email":"kristen.baird@rainbow-center.org","ContactName":"Kristen Baird","Mission":"To provide a safe nurturing and social environment in order to serve persons with special educational and developmental needs.","Description":"For over 40 years our goal at Rainbow Center has been to provide a positive, safe, gentle learning environment so children with special needs can develop self-esteem and improve their academic and coping skills when faced with daily challenges. Rainbow Center works with 20 metro, suburban and rural school districts for students in the day school program with varying diagnoses such as Autism, behavior disorders and other multi-categorical disabilities.\n\nIn 1996, Rainbow Options, our Adult Day Habilitation program, was initiated to meet the growing, local community needs of clients over the age of 21 who could not fit into the workshop or other supported employment. This exciting venture started with one client and now serves over 60 adults with severe disabilities. Rainbow Center Day School and Rainbow Options Adult Day Habilitation both feature a very active Community Access Program. Learning where to go, meeting community expectations and actively connecting with the community all are valuable experiences for the students and adults in the Rainbow programs.","LinkVolunteer":"http://www.rainbow-center.org/volunteer","LinkWebsite":"www.rainbow-center.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/132.png","City":"Blue Springs","State":"MO","Lat":39.02790069580078,"Lng":-94.30339813232422},{"Id":133,"Name":"Flourish Furnishings, Inc","Address":"11971 Grandview Road","ZipCode":"64030","Phone":"8169468601","Email":"rich@flourishfurnishings.org","ContactName":"Rich Shockey","Mission":"Flourish Furnishings’ mission is to improve lives by providing essential home furnishings to those seeking housing stability.","Description":"Flourish Furnishings provides whole home furnishings to individuals moving into self sufficiency after a period of houselessness, shelter, incarceration or catestrophic event.  We are the only furniture bank in KC serving over 60 partner agencies making case management referrals for their clients.","LinkVolunteer":"https://www.cervistech.com/acts/console.php?console_id=0159\u0026console_type=event\u0026ht=1","LinkWebsite":"https://flourishfurnishings.org","LinkWishlist":"https://bit.ly/flourishfurnishings","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/133.png","City":"Grandview","State":"MO","Lat":38.904701232910156,"Lng":-94.53289794921875},{"Id":134,"Name":"Kaye\u0027s Learning Corner","Address":"3704 Elmwood Ave","ZipCode":"64128","Phone":"8166218308","Email":"KayesLearningCorner@gmail.com","ContactName":"Crystal Turner","Mission":"Kaye\u0027s Learning Corner is a Preparatory Preschool that believes that every child is entitled to a quality education despite their financial background. Kaye\u0027s provides a strong, effective and independent voice for children of Kansas City\u0027s Urban Core. The Mission of Kaye\u0027s is to ensure every child has a safe start, a fair start, a moral start in their adolescence and a successful passage into kindergarten.","Description":"Kaye\u0027s Learning Corner is always in need of cots for nap time, books for our kiddos to read (we have a library that they check out of weekly and we need more learning material), markers, pencils, paper, arts \u0026 crafts, free-play materials, swing for outside, basketball goal, outside toys, blankets and pillows for nap time. ","LinkVolunteer":"KayesLearningCorner@gmail.com","LinkWebsite":"www.KayesLearningCorner.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/Y6AQ6R4O192U/ref=nav_wishlist_lists_1?_encoding=UTF8\u0026type=wishlist","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/134.png","City":"KANSAS CITY","State":"MO","Lat":39.05799865722656,"Lng":-94.53070068359375},{"Id":135,"Name":"CASA of Johnson and Wyandotte Counties","Address":"6950 Squibb Road, #300","ZipCode":"66202","Phone":"9137154031","Email":"njulien@casajwc.com","ContactName":"Natalie Julien","Mission":"To empower abuse and neglected children with a volunteer\u0027s voice in court by seeking a safe and permanent home for each child.","Description":"CASA volunteers make sure that the abuse and neglect the children suffered at home does not continue at the hands of the system. Because they handle just one or two cases at a time, CASAs give each child the sustained, personal attention he or she deserves. Through contact with the child, family members, and other interested parties, the CASA volunteer provides critical information to the Judge which results in better and more informed decisions for the child. In advocating for these children, the program works to break the cycle of abuse and builds stronger, happier, and better-adjusted children, providing a benefit to the entire community.","LinkVolunteer":"www.casajwc.org","LinkWebsite":"www.casajwc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/135.png","City":"Mission","State":"KS","Lat":39.01679992675781,"Lng":-94.66529846191406},{"Id":136,"Name":"Truman Heritage Habitat for Humanity","Address":"505 N Dodgion St","ZipCode":"64050","Phone":"8164616551","Email":"Lbrowne@trumanhabitat.org","ContactName":"Lindsay Browne","Mission":"Seeking to put God\u0027s love into action, Habitat for Humanity brings people together to build homes, communities, and hope.  ","Description":"People in your community and all over the world, partner with Habitat for Humanity to build or improve a place they can call home. Habitat homeowners help build their homes alongside volunteers and pay an affordable mortgage. With our help, Habitat homeowners achieve the strength, stability, and independence they need to build a better life for themselves and their families.  In addition to building and rehabbing homes for families we also have financial coaching and home repairs so people can age in place.  ","LinkVolunteer":"https://trumanhabitat.org/quick-sign-up/","LinkWebsite":"https://trumanrestore.org/items-we-accept/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/136.jpg","City":"Independence","State":"MO","Lat":39.096099853515625,"Lng":-94.41020202636719},{"Id":137,"Name":"Bautista Project Inc ","Address":"3709 GLOBE THISTLE DR","ZipCode":"33619","Phone":"8135707282","Email":"Thebautistaprojectinc@gmail.com","ContactName":"Marla Bautista","Mission":" The Bautista Project Inc. is a nonprofit organization that provides basic living essentials, educational resources, support groups, and other necessary resources to assist homeless community members with reintegration. ","Description":"As a nonprofit that services homeless community members, we are always on the streets. Listening and mentoring those in need. We are building individualized plans that cater to the specific needs of each homeless person. Creating a program that will help them thrive and successfully reintegrate into work, and home. ","LinkVolunteer":"https://www.thebautistaprojectinc.org/meet-the-team","LinkWebsite":"www.thebautistaprojectinc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/ZC63QLNRFBX8?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/137.jpg","City":"TAMPA","State":"FL","Lat":27.91360092163086,"Lng":-82.37300109863281},{"Id":138,"Name":"NourishKC","Address":"750 Paseo Blvd","ZipCode":"64106","Phone":"4802775312","Email":"rmorningstar@nourishkc.org","ContactName":"Rachel Morningstar","Mission":"NourishKC is a nonprofit dedicated to building a food-secure region in the Greater Kansas City area, both in providing healthy food and in empowering the poor to move beyond the barriers of poverty with dignity.","Description":"In operation for more than 25 years, we operate several food programs including the Kansas City Community Kitchen at 750 Paseo, a network of emergency food pantries and meal programs, food rescue and the Culinary Training Program. We aim is to feed anyone in need and change lives in the process by partnering with agencies and helping our volunteers build community.","LinkVolunteer":"https://nourishkc.org/volunteer/","LinkWebsite":"http://nourishkc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2Y7TJ5ZA7T7BW/ref=nav_wishlist_lists_1?_encoding=UTF8\u0026type=wishlist","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/138.png","City":"Kansas City","State":"MO","Lat":39.10459899902344,"Lng":-94.56400299072266},{"Id":139,"Name":"True Light Family Resource Center","Address":"717 E 31st St","ZipCode":"64109","Phone":"8164336429","Email":"tlfrcsheltermgr@gmail.com","ContactName":"Patricia Porche","Mission":"We serve at risk individuals and families by providing for critical needs connecting to community resources, and teaching job and life skills in a safe supportive environment.","Description":"We are a resource center that provide emergency food, a clothes closet, referrals, a day shelter for women and children and a transitional home for single women with no dependents.","LinkVolunteer":"","LinkWebsite":"truelightfrc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/139.jpg","City":"Kansas City","State":"MO","Lat":39.070499420166016,"Lng":-94.57569885253906},{"Id":140,"Name":"Varsity Esports Foundation","Address":"509 Walnut Street, Suite 201","ZipCode":"64106","Phone":"8169203016","Email":"bubba@varsityesportsfoundation.org","ContactName":"Bubba Gaeddert","Mission":"VEF strives to create an inclusive, safe, and aspirational network of gaming communities for all.","Description":"The Varsity Esports Foundation is a 501(c)(3) organization established to offer financial assistance to schools and to provide a pipeline for students to reach their potential through esports. We strive to increase literacy around the esports industry’s positive impact on healthy lifestyles, mental health, community, and STEM.","LinkVolunteer":"https://www.varsityesportsfoundation.org/fundraise","LinkWebsite":"https://www.varsityesportsfoundation.org/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/140.png","City":"Kansas City","State":"MO","Lat":39.10820007324219,"Lng":-94.58110046386719},{"Id":141,"Name":"Sleepyhead Beds","Address":"5604 Troost Ave","ZipCode":"64110","Phone":"8165479965","Email":"progmgr@sleepyheadbeds.org","ContactName":"Program Manager","Mission":"Sleepyhead Beds improves the quality of life for children and their families by providing clean, reusable beds and bedding. We also contribute to the health and environment of our community by sanitizing beds and keeping them out of landfills.","Description":"The simple answer: we take gently-used, donated beds and bedding (properly sanitize them) and distribute them to Kansas City area children and families in need, free of charge. ","LinkVolunteer":"https://sleepyheadbeds.org/volunteer/","LinkWebsite":"http://www.sleepyheadbeds.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/16TPBO5B8IMS?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/141.jpg","City":"Kansas City","State":"MO","Lat":39.024898529052734,"Lng":-94.57430267333984},{"Id":142,"Name":"Center For Recorded Music","Address":"5817 Harrison St","ZipCode":"64110","Phone":"9134844314","Email":"info@centerforrecordedmusic.org","ContactName":"Kelsyn Rooks","Mission":"Dedicated to the concept of social listening and learning.  Anchored in sharing the artistic, technical, and societal histories of recorded music.  \nThe Center will offer an alternative to the self-isolation that current technologies have fostered.  \nThe art of listening, learning, and discussion in a relaxed group setting has never been more meaningful.  \nInsightful, curated programs and presentations offer a unique, comfortable, and participatory environment.  \nA full range of musical discoveries for all ages can flourish through significant audio experiences that individuals and other institutions cannot replicate.","Description":"The Center For Recorded Music is a Missouri non-profit founded in 2020 in Kansas City. We are building a community anchored in celebrating the artistic, technical, and societal history of recorded music. Our state-of-the-art facility will be a cultural center and living archive, with world-class sound reproduction and a full range of musical exhibits, presentations, and discoveries for all ages.\n\nTogether with musicians, educators and industry professionals, the Center For Recorded Music will take advantage of its Kansas City base to provide musical journeys and incredible audio experiences other institutions cannot replicate in an amazing location for music lovers to gather and share.","LinkVolunteer":"","LinkWebsite":"https://www.c4rm.org","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/142.jpg","City":"Kansas City","State":"MO","Lat":39.02109909057617,"Lng":-94.57499694824219},{"Id":144,"Name":"Hyman Brand Hebrew Academy","Address":"5801 W 115th ST.","ZipCode":"66211","Phone":"9133278168","Email":"ccowan@hbha.edu","ContactName":"Cristina Cowan","Mission":"To prepare students for fulfilling lives as Jews and as honorable, contributing citizens.","Description":"Hyman Brand Hebrew Academy is a K-12 independent community Jewish day school in the heart of the Midwest. Serving the Greater Kansas City Jewish community for more than 50 years, HBHA is committed to working in partnership with our parents and students to support the emotional, spiritual, academic, and physical growth of our students. As a school, we are dedicated to providing a nurturing, collaborative, and – most important – joy-filled Jewish environment where students can grow into their best selves.\n\nWe live by our core values to provide the best for our students, including a strong academic foundation with individualized attention, all emanating from Jewish values.","LinkVolunteer":"","LinkWebsite":"www.hbha.edu","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/144.png","City":"Overland Park","State":"KS","Lat":38.918399810791016,"Lng":-94.65290069580078},{"Id":145,"Name":"Friends of Johnson County Library","Address":"8279 Melrose Dr","ZipCode":"66214","Phone":"9134924791","Email":"book@friendsofjcl.org","ContactName":"Karin Dembinski","Mission":"The purpose of the Friends is to bring together individuals interested in the Johnson County Library system, promote informed community interest in the Library functions, resources, services and needs and to raise supplementary funds for Johnson County Library.","Description":"We accept *gently-used* adult and children\u0027s books, textbooks, DVDs, music CDs, audiobooks on CD, LPs and puzzles.\n\nNo magazines, board games, encyclopedia sets, VHS and music tapes, or anything damaged or icky. If you wouldn\u0027t give it to a friend, don\u0027t give it to the Friends!","LinkVolunteer":"https://joco.samaritan.com/recruiter/index.php?class=OppSearch\u0026recruiterID=501\u0026act=search_all\u0026type=all","LinkWebsite":"https://www.friendsofjcl.org/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/145.jpg","City":"Lenexa","State":"KS","Lat":38.978599548339844,"Lng":-94.70559692382812},{"Id":147,"Name":"Amethyst Place","Address":"2735 Troost","ZipCode":"64109","Phone":"8163438925","Email":"mandy@amethystplace.org","ContactName":"Mandy Caruso-Yahne","Mission":"Amethyst Place seeks to inpsire transformational healing and empower generations of women and children to achieve recovery (from substance use disorder), reunification, and resilience. ","Description":"We are a supportive housing program for single mothers and their children, providing each family with their own fully furnished apartment and an array of services to help them stay on track in their recovery while rebuilding their lives and relationships. ","LinkVolunteer":"https://amethystplace.org/volunteer/","LinkWebsite":"www.amethystplace.org","LinkWishlist":"https://a.co/6osUKxM","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/147.png","City":"Kansas City","State":"MO","Lat":39.07659912109375,"Lng":-94.57060241699219},{"Id":148,"Name":"Memorial Church International","Address":"11424 Hickman Mills Drive","ZipCode":"64134","Phone":"8163637939","Email":"info@mcikc.org","ContactName":"LaMonica Bowens","Mission":"We are commissioned to show God\u0027s love to everyone and provide resources to help the live a fruitful and productive life in society.","Description":"Faith Based Organization","LinkVolunteer":"www.mcikc.org/volunteer","LinkWebsite":"www.mcikc.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/148.png","City":"Kansas City","State":"MO","Lat":38.9193000793457,"Lng":-94.52559661865234},{"Id":149,"Name":"Pepper Berries Teaching Emporium","Address":"17400 E Atherton Rd","ZipCode":"64058","Phone":"8162300007","Email":"preciouspetals64076@yahoo.com","ContactName":"Christine Williams","Mission":"\u0022Changing One Person, One Family, One Community at a Time\u0022 for growing their resource to improve their finances.  The old Chinese Preverb that says, \u0022Give a man a fish you feed him for a day.  Teach a man to fish you feed him for a lifetime.\u0022","Description":"We have an urban farm where we teach all styles of gardening.  They can work along side us and take produce home or we can help them learn how to grow at their home the style of gardens that will work best for their situation.  Then when the produce come on we will teach them how to cook from the garden, put food up for the winter with canning, dehydrating, fermenting and other methods of preserving food.  We also help them start selling their produce at farmer markets, grocery stores or wholesale accounts.  We will help them do added value products and labeling for them also.  In the education center we also teach art classes to kids and adults; drawing, painting, art history, crafts and floral design.  In the next to years we will be adding classes in high school math, writing, science, ceramics, sewing, jewelry making and much more.","LinkVolunteer":"https://www.facebook.com/groups/206274700546948/","LinkWebsite":"https://www.facebook.com/groups/206274700546948/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/344LVDASM7BLN?","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/149.png","City":"Independence","State":"MO","Lat":39.10300064086914,"Lng":-94.48500061035156},{"Id":150,"Name":"Resurrection Catholic School","Address":"325 N. 15th Street","ZipCode":"66102","Phone":"9133718101","Email":"fholcomb@rcskck.org","ContactName":"Felicia Holcomb","Mission":"Resurrection Catholic School at the Cathedral is an accredited preschool through 8th-grade school located in Kansas City, Kansas. Resurrection exists to live Christ’s love and to develop our talents to serve Him always.","Description":"Resurrection is a community that treats everyone with respect, where children achieve academic excellence, where families actively practice their Catholic faith and where the school and parish communities support each other.\n\nWe live by our core values:\n- Living Shared Faith\n- Embracing Diverse Tradition\n- Inspiring Individual Achievement\n- Celebrating Genuine Service\n- Answering the Call to Lead\n\nWhile Resurrection is steeped in Catholic tradition and values, students of all faiths are welcome at our school. We take pride in the diversity of our student body, which presents students with the opportunity to relate to and appreciate people of various cultures and ethnic groups.","LinkVolunteer":"https://www.rcskck.org/giving","LinkWebsite":"rcskck.org ","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/150.png","City":"Kansas City","State":"KS","Lat":39.1088981628418,"Lng":-94.64550018310547},{"Id":151,"Name":"Miles Exotic Pet Rescue","Address":"641 Portland Ave","ZipCode":"14621","Phone":"5853187828","Email":"Milesexoticpets@gmail.com","ContactName":"Chester Miles","Mission":"Our goal is to educate and offer an unique experience for people of all ages! Here we don’t think of our pets as pets, but as our kids. Our pets are members of the family.","Description":"At Miles Exotic Pet Rescue, we rescue and board exotic breeds of pets. Our goal is to educate and offer an unique experience for people of all ages! Here we don’t think of our pets as pets, but as our kids. Our pets are members of the family. We aim to keep all of our visitors informed on the growth of our family. All visitors are able to receive updates on their favorite family member through pictures, videos, and even blogs! In addition, we also offer educational videos to inform and bring awareness on exotic pets that aren’t often encountered, who still love and need to be loved just the same.\n","LinkVolunteer":"","LinkWebsite":"https://justpullup2020.wixsite.com/milesexoticpet","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/151.jpg","City":"Rochester","State":"NY","Lat":43.177799224853516,"Lng":-77.58989715576172},{"Id":152,"Name":"ICE STUDIOS SCHOOL OF DANCE","Address":"7714 Prospect Avenue","ZipCode":"64132","Phone":"8167860880","Email":"icestudiosdance@gmail.com","ContactName":"ISHA WILLIAMS","Mission":"Mission\n\nWe exist to teach performing arts to youth and build healthy lifestyles in a\n\nFaith-Based environment","Description":"ICE STUDIOS SCHOOL OF DANCE is a faith-based non-profit dance studio that offers professional dance classes to students of different ages and physical abilities with an emphasis on living a healthy lifestyle through exercise and proper nutrition. ICE STUDIOS was formed by Isha C. Williams as an after school exercise class. After a combination of activities, consults and parent focus groups on inner-city children\u0027s physical education needs, ICE STUDIOS School of Dance was founded in 2008.","LinkVolunteer":"https://form.jotform.com/212307603912043","LinkWebsite":"http://www.icestudiosdance.org","LinkWishlist":"https://a.co/c46UgcR","Pickup":true,"Dropoff":true,"Resell":true,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/152.png","City":"Kansas City","State":"MO","Lat":38.98529815673828,"Lng":-94.55799865722656},{"Id":154,"Name":"First United Methodist Medical Closet ","Address":"946 Vermont ","ZipCode":"66044","Phone":"7857645655","Email":"rkoester7485@gmail.com","ContactName":"Rick Koester","Mission":"Loan medical equipment to anyone who requests equipment.","Description":"Equipment usually loaned out: Walkers, rolator Walkers, wheelchairs, shower chairs, tub transfer chairs, commodes, toilet risers, canes, crutches, \u0026 ice machines.","LinkVolunteer":"","LinkWebsite":"http://FUMCLawrence.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/154.png","City":"Lawrence","State":"KS","Lat":38.965999603271484,"Lng":-95.23690032958984},{"Id":156,"Name":"Bethel Neighborhood Center","Address":"14 South 7th Street Trafficway","ZipCode":"66101","Phone":"9133718218","Email":"msonna@bethelcenter.org","ContactName":"MANG SONNA","Mission":"To empower individuals to achieve a renewed sense of hope, wellness, and self-sufficiency. ","Description":"Bethel Neighborhood Center opened its doors on April 11, 1911, as a mission center of The Women\u0027s Baptist Home Mission Society. They primarily served needy families living near or working in the meat-packing plants of the West Bottoms of Kansas City. Many of them were new immigrants from Eastern European countries. Bethel has been located in the urban core of Kansas City, Kansas in the heart of one of the ten poorest counties in the nation per capita. This area has a high concentration for immigrant resettlement in the Greater Kansas City metropolitan area.\n\n \n\nOur neighborhood has gone through many changes over the last 110 years, but our mission remains the same. Over the decades, several waves of immigrants from Africa, South and Central America, and Asia have come to Kansas City, Kansas and Bethel Center has been supporting them in their assimilation to the American life and culture. Over the decades, several waves of immigrants from Africa, South and Central America, and Asia have come to Kansas City, Kansas and Bethel has been supporting them in their assimilation to the American life and culture.","LinkVolunteer":"","LinkWebsite":"www.bethelcenter.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/156.jpg","City":"Kansas City","State":"KS","Lat":39.10210037231445,"Lng":-94.62650299072266},{"Id":157,"Name":"The Role-Players Guild of Kansas City","Address":"3708 Grand Ave","ZipCode":"64055","Phone":"","Email":"library@rpgkc.org","ContactName":"Rob Kraft","Mission":"We are the Role-Players Guild of Kansas City (RPGKC), a 501(c)(7) nonprofit tabletop hobby gaming advocacy organization dedicated to enhancing gaming in Kansas City and the surrounding areas since 1990.","Description":"One of the largest game clubs in the Midwest, we maintain relations with many game companies, industry luminaries, local game shops, and Midwest gaming groups. We play mainly role-playing games and board games, along with some miniatures, card games and live-action role-playing games (LARPs). Our members play at Guild-hosted events and often arrange their own game sessions. The majority of our members reside in the Kansas City metro area, with some located across the nation. New players welcome!","LinkVolunteer":"https://rpgkc.org","LinkWebsite":"https://rpgkc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/157.png","City":"Independence","State":"MO","Lat":39.05289840698242,"Lng":-94.4303970336914},{"Id":158,"Name":"Newhouse","Address":"P.O. Box 240019","ZipCode":"64124","Phone":"8164620508","Email":"chris@newhousekc.org","ContactName":"Christopher Stibbs","Mission":"Newhouse is the catalyst for survivors of domestic violence to rise through the impacts of trauma by providing an ecosystem of transformative services that lead to safety, self-sufficiency and whole-person healing. ","Description":"Domestic violence is a multi-faceted issue. To meet the unique needs of survivors and reverse the impacts of trauma, Newhouse provides a comprehensive ecosystem of whole person healing resources to confront a myriad of issues. Strategic collaboration and partnerships enable us to respond, shift and shatter the barriers that feed the cycle of domestic violence.","LinkVolunteer":"www.newhousekc.org/volunteer","LinkWebsite":"www.newhousekc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2H8PMFAVJKFSE?ref_=wl_fv_le","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/158.png","City":"Kansas City","State":"MO","Lat":39.000999450683594,"Lng":-94.5},{"Id":159,"Name":"Clay County Children\u0027s Services Fund","Address":"7001 N Locust Street, Suite D-205","ZipCode":"64118","Phone":"8165078897","Email":"kmacken@claycokids.org","ContactName":"Kathy Macken","Mission":"Clay County Children’s Fund provides services to protect the well-being and safety of children and strengthen families in Clay County.","Description":"Clay County Children\u0027s Services Fund finances programs that support the health and wellbeing of Clay County residents ages 0-19.  Programs we fund do focus on mental health services and social-emotional learning for children. ","LinkVolunteer":"","LinkWebsite":"www.claycokids.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/159.png","City":"Gladstone","State":"MO","Lat":39.221500396728516,"Lng":-94.57460021972656},{"Id":162,"Name":"Transition Zone, Inc.","Address":"2100 Prospect","ZipCode":"64127","Phone":"8168785219","Email":"jackie@tzonekc.org","ContactName":"Jacqueline Buycks","Mission":"Transition Zone\u0027s Mission: \nProvide a safe space where people are loved and accepted \nEquip youth and families with life skills to thrive\nEmpower individuals to walk in their purpose ","Description":"Transition Zone (TZone) is a safe space where youth , ages 12 to 18 years old, primarily in the urban core of the Greater Kansas City Metropolitan area are equipped with workforce skills, life skills and entrepreneurship development.  They are empowered with career readiness competencies, connection to the world of work, and are supported by a broad base of caring people, building and strengthening relationships while encouragingly walking alongside them throughout their career-path journey.  Youth experience regular guest career speakers/mentors who look like them, from various skill sets, giving youth a more personal connection to their career choice.  Sessions are held 5 days a week, Monday through Friday, from 12 p.m. to 4 p.m. during the summer (June through August).  During the winter/spring (September through May), youth attend session the first two Saturdays of every month, from 9 a.m. to 12 p.m. Youth are paid $100 per week for attending Summer sessions and $50 per month for attending Winter/Spring weekend sessions.  Our objectives:  (1) Equipping youth to be self-confident, (2) Equipping them to stand out to any employer, (3) Empowering them to excel in the workforce or in their own business.  Our approach:  (1) Activity-based learning, (2) Real-world experience, (3) Roleplaying, and (4) Hands-on learning.","LinkVolunteer":"www.tzonekc.org","LinkWebsite":"www.tzonekc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/162.png","City":"Kansas City","State":"MO","Lat":39.08660125732422,"Lng":-94.55220031738281},{"Id":163,"Name":"Camp Encourage","Address":"4025 Central Street","ZipCode":"64111","Phone":"8168307171","Email":"klee@campencourage.org","ContactName":"Kelly Lee","Mission":"The mission of Camp Encourage is to provide youth with autism spectrum disorder meaningful experiences in which they build the knowledge, courage, and skills to be empowered participants in the community. ","Description":"Camp Encourage is a local nonprofit, providing quality overnight camps and social outings for youth with autism. Our camps take place at Tall Oaks Conference Center in Linwood, KS. Each camp session includes both traditional camp activities and activities tailored around the individual campers’ interests. Our Connections program offers day excursions in the Kansas City area that are well-designed and structured social opportunities tailored to support campers on the autism spectrum.","LinkVolunteer":"https://campencourage.org/volunteer/","LinkWebsite":"campencourage.org","LinkWishlist":"https://www.amazon.com/gp/registry/wishlist/BOOIY4NOHBXN","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/163.jpg","City":"Kansas City","State":"MO","Lat":39.053001403808594,"Lng":-94.5884017944336},{"Id":164,"Name":"Accessibility Medical Equipment","Address":"311 Delaware Street, Suite 102A","ZipCode":"64105","Phone":"8662013829","Email":"CManion@ScriptedHealthcare.org","ContactName":"Carl Manion","Mission":"Your Access is Our Mission","Description":"We are a nonprofit durable medical equipment, supplies \u0026 home modification organization that provides recycled equipment to those in need. We are the only organization of our kind in the Greater Kansas City area Metro. By partnering with dozens of organizations in our region, we can often assist with funding for equipment and also help qualifying individuals with in-home care. We also provide individuals with new medical equipment at or near the wholesale price. It is our honor to provide abundant hospitality to all those in need!","LinkVolunteer":"","LinkWebsite":"www.amekc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/164.png","City":"Kansas City","State":"MO","Lat":39.10929870605469,"Lng":-94.58429718017578},{"Id":166,"Name":"PCs for People","Address":"518 Santa Fe St.","ZipCode":"64105","Phone":"8167862328","Email":"kkelly@pcsforpeople.com","ContactName":"Kelli Kelly","Mission":"Secure e-Waste Recycling to Support Affordable and Reliable Internet and Computers for Low Income Families","Description":"Our Work Supports-\nDigital Equity: Recycled computers are refurbished and distributed back into the community to support equal access to technology for low-income families.\nWorkforce Development: Our recycling warehouses employ adults from diverse backgrounds and with disabilities.\nThe Environment: If items are not reusable, we recycle every component, keeping millions of pounds of e-waste out of landfills.\n","LinkVolunteer":"","LinkWebsite":"pcsforpeople.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/166.png","City":"Kansas City","State":"MO","Lat":39.10749816894531,"Lng":-94.59880065917969},{"Id":170,"Name":"Phoenix Family","Address":"3908 Washington St","ZipCode":"64111","Phone":"8166128832","Email":"jwelch@phoenixfamily.org","ContactName":"Jessica Welch","Mission":"Phoenix Family empowers people living in low-income housing communities with the on-site support they need to gain stability and achieve self-sufficiency.","Description":"Phoenix Family offers programs to more than 5,100 residents living in 34 communities in 13 cities throughout Iowa, Kansas, and Missouri. Through our HIKE, Families First, and Senior Empowerment programs, we provide an integrated, broad range of services tailored to the individual person, including access to onsite pantries and donations right where they live. Our programs enable people to stay in their homes and with their families while they make progress towards and attain self-sufficiency. Combined, our activities empower children, families and seniors to access the essential resources they need to improve their lives and break generational poverty.\n\nWe accept donations BY APPOINTMENT ONLY at our home office at 3908 Washington St, KCMO 64111 - please call Jessica Welch 816-612-8832 or email jwelch@phoenixfamily.org to confirm items being donated and arrange a time we can accept them!","LinkVolunteer":"http://www.phoenixfamily.org/get-involved/volunteerapplication.html","LinkWebsite":"www.phoenixfamily.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/170.png","City":"Kansas City","State":"MO","Lat":39.05649948120117,"Lng":-94.591796875},{"Id":171,"Name":"Friends of Recovery Association","Address":"6422 Santa Fe Dr","ZipCode":"66202","Phone":"9137220367","Email":"l_a_larson@yahoo.com","ContactName":"Leigh Anne Larson","Mission":"The mission of Friends of Recovery Association is to support and collaborate with Oxford Houses in Kansas, which are self-supporting, democratically operated homes for recovering individuals. Friends of Recovery and Oxford Houses will assist these individuals to attain and sustain recovery from subs","Description":"Oxford House is a concept in recovery from alcohol and substance use. An Oxford House is a democratically run, self-supporting, and drug-free home, where each house is an effective and low-cost method of preventing relapse. Oxford House has been listed as a Best Practice on the National Registry of Evidence-based Programs and Practices [NREPP] and singled out as an effective tool for long-term recovery in the U.S. Surgeon General’s report: “Facing Addiction in America: The Surgeon General’s Report on Alcohol, Drugs, and Health, 2016.” Preventing relapse was the purpose of the first Oxford House, and this purpose is replicated in each Oxford House today.\n\nFriends of Recovery advocates for the service participants and focuses on; finding houses to rent, getting charters from Oxford House Inc, recruiting initial residents, teaching the system of operations, building chapters, balancing the number of houses to the demand of the service participants, developing links to providers, developing employment links, networking with other social service agencies, compiling resources (i.e., parenting classes, bus schedule, funds for moving into a house, community service hours) and documenting demographics, vacancy rates, and relapse rates. \nCase management for the Kansas Oxford Houses includes attending house and chapter meetings, landlord negotiations, and mediating disagreements between house members, landlords, or neighbors. Friends of Recovery gives a monthly New Member Orientation and hosts workshops with house and chapter officers, communication, Oxford House model training, and trauma-informed care. Friends of Recovery is the liaison between Oxford House Inc and the Kansas Oxford Houses.\nOxford House is a concept and operation system for a person with a history of alcohol and substance use to have a realistic chance to get comfortable enough to stay alcohol and substance-free forever. For the person new in recovery, such behavior change takes an opportunity, motivation, time, and peer support. The Oxford House self-run system of operations replaces hopelessness with hope and failure with success. This self-support concept saves taxpayers money and produces successful recovery without relapse. More than 2,400 autonomous sober houses utilize the Oxford House model to assist over 20,000 individuals. Oxford House supports more than 35,000 individuals during the year.   In Kansas, there are 157 Oxford Houses for over 1300 individuals in recovery at any given time. Two thousand eight hundred sixty-two service participants utilized the Kansas Oxford Houses in 2021.  \n","LinkVolunteer":"","LinkWebsite":"http://www.friendsofrecovery.com","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/171.jpg","City":"Overland Park","State":"KS","Lat":39.01179885864258,"Lng":-94.67289733886719},{"Id":173,"Name":"Community LINC","Address":"4012 Troost Ave ","ZipCode":"64110","Phone":"8165615862","Email":"criddle@communitylinc.org","ContactName":"Coleece Riddle","Mission":"Ending homelessness for the next generation and the next.","Description":"For over 35 years, Community LINC has ended homelessness for thousands in Greater Kansas City.\n\nWe are the largest single site provider for homeless services in the metropolitan area. With housing programs, supportive services, community-wide services, coordinated exits and placements—as well as building community awareness—Community LINC is a beacon of hope for our neighbors experiencing homelessness.","LinkVolunteer":"https://communitylinc.org/volunteer/          https://communitylinc.org/rent-party-volunteer/","LinkWebsite":"https://communitylinc.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2V6V2O6M7Q9TL?ref_=wl_share   ( This wish list is for our Children\u0027s Program)","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/173.png","City":"Kansas City","State":"MO","Lat":39.05379867553711,"Lng":-94.57260131835938},{"Id":174,"Name":"Poetry for Personal Power","Address":"810 Baltimore Ave","ZipCode":"64105","Phone":"8166991980","Email":"erand@poetryforpersonalpower.org","ContactName":"Edward Rand","Mission":"P3 has proven that education, advocacy, peer support, and the arts are revolutionary tools that can help peers to make sustainable changes in behavioral health care. Our evidence-based programs work towards helping people to rebuild themselves and when people are built up we are able to build health","Description":"Outreach is done through events and advocacy within health coalitions and other sectors to give community members and healthcare consumers a voice as well as education on resources.  Our non-clinical peer support specialists and peer recovery coaches deliver education about resilience, health, wellness tools, and resources that aid in trauma reduction and recovery support.","LinkVolunteer":"https://www.poetryforpersonalpower.org/give","LinkWebsite":"www.poetryforpersonalpower.org","LinkWishlist":"New computer equipment for our office","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/174.png","City":"Kansas City","State":"MO","Lat":39.10409927368164,"Lng":-94.58450317382812},{"Id":175,"Name":"Wyandotte Angels ","Address":"4434 n 79th street ","ZipCode":"66109","Phone":"9136363044","Email":"wyandotteangels@yahoo.com","ContactName":"Jalynda Cervantes ","Mission":"Providing food, clothing and hygiene to those in need","Description":"Grassroots group ","LinkVolunteer":"","LinkWebsite":"https://www.facebook.com/groups/298361168037631/","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/175.jpg","City":"Kansas City ","State":"KS","Lat":39.16790008544922,"Lng":-94.76190185546875},{"Id":177,"Name":"FRONT PORCH ALLIANCE - Kansas City","Address":"3210 Michigan Ave., Suite 400","ZipCode":"64109","Phone":"8169218812","Email":"jetaime@frontporchalliance.org","ContactName":"Je T\u0027aime Taylor","Mission":"Front Porch Alliance works together with Kansas City\u0027s eastside children and families to meet their changing needs at home and in school.","Description":"Front Porch launched in 1999 with three volunteers going door-to-door in the Ivanhoe neighborhood, asking how they could help. For more than 20 years, our programs have impacted families in Eastside Kansas City. Today, we remain dedicated to intentional partnership with area residents as they overcome multiple, concurrent, and often systemic success barriers. Our deep community roots link participants to resources that help balance the inequitable distribution of resources and opportunities impacting people’s ability to succeed.\n\nWe reach more than 700 individuals annually through a continuum of programming chosen and shaped by our community. Our mission is to partner with Eastside children and families to meet their changing needs at home and school. Programming includes:\n- NEIGHBORHOOD FAMILIES: An early childhood education, home-visiting program for children (birth to five) that meets families’ basic needs and provides childhood development resources.\n- YOUTH JOURNEYS: A catalog of six no-cost educational youth programs for ages five to 16 featuring a social-emotional health focus.\n- COMMUNITY ENGAGEMENT: A collection of campaigns to engage, educate, and support the community.\n","LinkVolunteer":"email: donald@frontporchalliance.org","LinkWebsite":"www.frontporchalliance.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2AV488YRI2G37?ref_=wl_share","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/177.png","City":"KANSAS CITY","State":"MO","Lat":39.06779861450195,"Lng":-94.5614013671875},{"Id":178,"Name":"Richardson Early Learning ","Address":"3515 Park Ave","ZipCode":"64109","Phone":"8164182605","Email":"tbrandt@kcpublicschools.org","ContactName":"Theresa Brandt","Mission":"To provide a quality education that prepares all of our students, regardless of background or circumstances, for success in college, career and life. To produce scholars who are high-achieving critical thinkers, prepared to succeed in a constantly changing world and engaged in their community.","Description":"Serving over 200 students with a comprehensive program that provides supports for academics, family services, health, nutrition, mental health and disabilities.","LinkVolunteer":"tbrandt@kcpublicschools.org","LinkWebsite":"www.kcpublicschools.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/178.jpg","City":"Kansas City ","State":"MO","Lat":39.06230163574219,"Lng":-94.55609893798828},{"Id":179,"Name":"Metropolitan Community College Penn Valley","Address":"3201 SW Trafficway CC 200","ZipCode":"64111","Phone":"7859179279","Email":"tiffany.learned@mcckc.edu","ContactName":"Tiffany Learned","Mission":"Preparing students, serving communities, creating opportunities for all.","Description":"Metropolitan Community College is dedicated to serving the educational needs of the community. The college\u0027s programs are intended to help students understand themselves, the society of which they are a part and the universe in which they live.\n\nAt the same time, MCC provides opportunities for students to develop occupational skills. Faculty and administrators cooperate to create an environment that stimulates intellectual growth and nurtures academic freedom for students and instructors alike. The programs offered are intended to encourage lifelong learning.\n\nMCC employees are committed to providing equal opportunity for all persons regardless of age, creed, race or gender.","LinkVolunteer":"","LinkWebsite":"http://mcckc.edu ","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/179.jpg","City":"Kansas City","State":"MO","Lat":39.069698333740234,"Lng":-94.59310150146484},{"Id":181,"Name":"Kansas City Blind All-Stars Foundation","Address":"1100 State Avenue, Attn: Makerspace","ZipCode":"66102","Phone":"9136455357","Email":"lknopp@kssdb.org","ContactName":"Lydia Knopp","Mission":"KSSB is a catalyst and leader in the development of exemplary programs and practices in vision services in Kansas.  We build local capacity throughout the state via strategic partnerships to ensure learners with visual impairments are able to assume responsible roles in society and lead fulfilling lives.","Description":"In keeping with its mission, KCBAS has a policy of nondiscrimination, diversity and inclusion in the selection of its Board members, associations, volunteers and vendors. Specifically, it is the policy of the Board to not discriminate on the basis of race, age, sex, disability or religion. The Board values the fundamental value and dignity of all persons. One of the Board’s goals is to foster belonging and empowerment for our blind and low vision students at the school and in the community. We will listen to and work with any vendor or association who values our mission and goals. We will listen to and engage with our diverse communities in an effort to make the community more inclusive.","LinkVolunteer":"","LinkWebsite":"https://www.kcblindallstars.org/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/181.png","City":"Kansas City","State":"KS","Lat":39.11750030517578,"Lng":-94.6395034790039},{"Id":182,"Name":"BTC Building Brighter Futures","Address":"4042 Indiana ave","ZipCode":"64130","Phone":"8167187423","Email":"pdanley@btcbbf.org","ContactName":"Patrick Danley","Mission":"To assist citizens deemed at risk with reducing life and career barriers to achieve their individualized goals that led to self sufficiency and law bidding tax paying status.","Description":"To assist citizens deemed at risk with reducing life and career barriers to achieve their individualized goals that led to self sufficiency and law bidding tax paying status.","LinkVolunteer":"","LinkWebsite":"www.btcbbf.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/182.jpg","City":"Kansas City","State":"MO","Lat":39.051700592041016,"Lng":-94.5447998046875},{"Id":189,"Name":"Stitching Change","Address":"1303 Central Ave","ZipCode":"66102","Phone":"9132714800","Email":"rstitchingchange@gmail.com","ContactName":"Rakmi Shaiza","Mission":"Empowering women to empower themselves ","Description":"We look with women and youth most immigrant and refugees. We teach sewing, upcycling designs, basic digital literacy and how to set a small business from home.  ","LinkVolunteer":"","LinkWebsite":"Stitchingchange.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/189.png","City":"Kansas City","State":"KS","Lat":39.103599548339844,"Lng":-94.6438980102539},{"Id":190,"Name":"Hold Em Up 4 Care","Address":"2916 E. 81st St","ZipCode":"64132","Phone":"8168245005","Email":"info@heu4ckc.org","ContactName":"Tiffany Price","Mission":"\n\nTo support equality for youth and adults by providing perfect fit clothing, elevating self-esteem, and supporting mental health resiliency with programs that directly improve their health and well-being.","Description":"Hold Em Up 4 Care (HEU4C) is a nonprofit organization in Kansas City, MO providing a specialty service to underserved youth in the Kansas City Metropolitan Area.","LinkVolunteer":"","LinkWebsite":"http://www.heu4ckc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/190.png","City":"Kansas City ","State":"MO","Lat":38.97990036010742,"Lng":-94.55380249023438},{"Id":191,"Name":"Giving Hope \u0026 Help Inc","Address":"PO Box 2446","ZipCode":"64063","Phone":"8165079760","Email":"donate@givinghopeandhelp.com","ContactName":"Jessica Lynn McClellan","Mission":"Giving Hope \u0026 Help is a 501c3, nonprofit organization that supports domestic violence survivors, provides essential resources to end period poverty, empowers college bound and non-traditional students and inspires cancer patients, lifting all those we serve to live their best life. ","Description":"History of GH\u0026H\n\n1.\tFeminine Hygiene Product Drives to End Period Poverty and promote Domestic Violence Awareness \u0026 Prevention\nGiving Hope \u0026 Help Inc. launched in honor of the founder’s Thanksgiving birthday.  \n“The Thanksgiving Birthday Give”-Launch of Giving Hope \u0026 Help and 1st Annual Feminine Hygiene Product Drive to collect sanitary napkins and tampons. Over 5,000 products were collected to benefit the domestic violence shelter, Hope House in Jackson County- 2 locations. To date, Giving Hope \u0026 Help supports 25\u002B domestic violence shelters/places of refuge. Texas Giving Hope \u0026 Help launched Nov. 2015, with the first annual feminine product drive. \n\nGiving Hope \u0026 Help collects period products and packaged children’s and women’s underwear year-round via partnerships with businesses, organizations, companies, and the community to support the NO FEMALE WITHOUT or NO MENSTRUATOR WITHOUT PERIOD PRODUCTS MOVEMENT. This movement benefits domestic violence survivors (and the shelters in which they live), natural disaster survivors, the homeless community, schools, women, and girls’ organizations and those in need of feminine care locally and across the globe. \n\nGiving Hope \u0026 Help has made a global impact to end period poverty. GH\u0026H has shipped feminine products to Cambodia, Nairobi-Kenya, Haiti, Mexico the Bahamas. GH\u0026H has supported over 250 girls with period products and girl’s underwear in Limuru, Kenya from 2017 to the present.  To date, GH\u0026H local and global impact has benefited over 50,000 women and girls. \n\n2.\tLOVE Bags 4 Cancer Donation \u0026 Delivery Events\n A portion of the proceeds benefits the American Cancer Society and cancer nonprofits. \nThe LOVE Bags 4 Cancer initiative uplifts hospitalized male and female cancer patients annually in honor of Valentine\u0027s Day and Mother\u0027s Day.  Over six hundred cancer patients have been inspired and uplifted with the LOVE Bags 4 Cancer since February 2015.  Jessica was inspired to launch this initiative in honor of her late niece who fought cancer for six years. Giving Hope \u0026 Help has partnered with Kansas City metro area hospitals in Kansas and Missouri to deliver the LOVE Bags 4 Cancer. \n\n3.\tEducation Is Your Passport Program (EIYP)\nThe program provides educational and financial assistance for Pre-K through adult college students.  The program\u0027s annual scholarship initiative: The Education Is Your Passport Scholarship Program, benefits underserved high school seniors and non-traditional, college bound students.  During the 2020 and 2021 pandemic, the program awarded thirty college scholarships in addition to 1 FULL-RIDE SCHOLARSHIP to Metropolitan Community College, Penn Valley. \n","LinkVolunteer":"https://givinghopeandhelp.dm.networkforgood.com/forms/volunteer-signup-and-newsletter-subscription","LinkWebsite":"www.givinghopeandhelp.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/3LHNLEX3K31BI/ref=nav_wishlist_lists_1","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/191.png","City":"Lee\u0027s Summit ","State":"MO","Lat":39.00199890136719,"Lng":-94.5},{"Id":193,"Name":"UrbnHub","Address":"117 S Lexington Street Suite 101( Mailing Address)","ZipCode":"64701 ","Phone":"8163791799","Email":"daciamartin@urbnhubkc.org","ContactName":"Dacia Martin","Mission":"The mission of UrbnHub is to connect people to opportunities in their local community through a centralized resource database, events calendar, and streamlined referral and application process.","Description":"Our customized referral system allows us to expedite a streamlined connection between community members and community resources to see all aspects of a person thrive.  UrbnHub Information and Referral Specialists answer questions, provide information and referrals about UrbnHub\u0027s programs and services, and connect clients to various resources, supports, and services.","LinkVolunteer":"https://urbnhubkc.org/volunteer/","LinkWebsite":"https://urbnhubkc.org/","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/193.png","City":"Harrisonville","State":"MO","Lat":38.654300689697266,"Lng":-94.34770202636719},{"Id":195,"Name":"Children of Incarcerated Parents ","Address":"5110 Pittman ","ZipCode":"64133","Phone":"8165179504","Email":"bcourtney@childrenip.org","ContactName":"Barbara Courtney ","Mission":"The mission of C.O.I.P. is to mend the broken hearts and heal the souls of children who have lost a parent to incarceration.  ","Description":"C.O.I.P. provides services to mitigate the social and \nemotional impact on children with an incarcerated parent. C.O.I.P. raises awareness about children who are dealing with anger, shame, anxiety and abandonment issues because of a parent who is currently or has been incarcerated","LinkVolunteer":"http://www.childrenip.org","LinkWebsite":"https://www.childrenip.org/","LinkWishlist":"http://www.childrenip.org","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/195.png","City":"Kansas City ","State":"MO","Lat":39.029998779296875,"Lng":-94.46269989013672},{"Id":196,"Name":"Cross-lines","Address":"736 Shawnee ave","ZipCode":"66105","Phone":"9133879886","Email":"marlen@cross-lines.org","ContactName":"Marlen Hernandez","Mission":"The mission of Cross-Lines is to provide people in the Kansas City area affected by poverty with services and opportunities that encourage self-confidence, meet the needs of today, and provide tools for future self-sufficiency.","Description":"Cross-Lines clients include individuals, families, and seniors who are living in poverty. Many of our clients are working one or more jobs. Some have mental and physical conditions that prevent them from being able to work.\n\nOne unexpected medical expense, a car breaking down or a cut in their hours at work often is what caused our clients to need a helping hand. Cross-Lines is there to give a hand up to people when they need it most.","LinkVolunteer":"https://www.cross-lines.org/file_download/inline/4827fe4d-6ee6-44b1-81dd-fdddf05c3092","LinkWebsite":"cross-lines.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/196.png","City":"kansas city","State":"KS","Lat":39.08610153198242,"Lng":-94.62779998779297},{"Id":197,"Name":"Armourdale Renewal Association","Address":"801 Armourdale Pkwy","ZipCode":"66105","Phone":"9133715696","Email":"ara@armourdale.org","ContactName":"Monica Mendez","Mission":"Help Residents and Business enhance and develop a strong, vibrant community.","Description":"The Armourdale Renewal Association will take the initiative to identify issues that support our mission and actively partner with community partners to find effective solutions. ","LinkVolunteer":"","LinkWebsite":"www.armourdale.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/197.jpg","City":"Kansas City","State":"KS","Lat":39.08420181274414,"Lng":-94.61799621582031},{"Id":198,"Name":"Friends of Yates","Address":"1418 Garfield","ZipCode":"66104","Phone":"9134849553","Email":"foyates@aol.com","ContactName":"LaDora","Mission":"To eradicate social ills that prevent a safe community environment for individuals, youth, families and communities.                       ","Description":"We provide crime prevention candlelight services, domestic violence housing and services and annual motivational programs.","LinkVolunteer":"http://friendsofyates.org","LinkWebsite":"http://friendsofyates.org","LinkWishlist":"http://friendsofyates.org","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/198.jpg","City":"Kansas City,","State":"KS","Lat":39.125999450683594,"Lng":-94.64510345458984},{"Id":199,"Name":"Heartland 180, Inc.","Address":"1201 N. 13th St.","ZipCode":"66106","Phone":"9135213370","Email":"mattzimmer@heartland180.org","ContactName":"Matt Zimmer","Mission":"​Heartland 180, Inc. is a youth services organization that provides in-school and after-school programming for Middle and High School students to help them direct their future through Social Emotional Learning (SEL) curriculum.  ","Description":"​Heartland 180, Inc. is a youth services organization that provides in-school and after-school programming for Middle and High School students to help them direct their future through Social Emotional Learning (SEL) curriculum.  H180 also serves parents of youth looking for “handles” on how to better communicate with their strong-willed child or child involved in self-destructive behavior for a better home environment for the family.","LinkVolunteer":"https://www.heartland180.org/referrals","LinkWebsite":"www.heartland180.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/199.png","City":"Kansas City","State":"KS","Lat":39.11750030517578,"Lng":-94.64309692382812},{"Id":201,"Name":"K-State Extension - Wyandotte Co","Address":"1216 N 79th Street","ZipCode":"66112","Phone":"3169936442","Email":"ddias@ksu.edu","ContactName":"Denise Dias","Mission":"K-State Research \u0026 Extension - Wyandotte County is dedicated to a safe, sustainable, competitive food and fiber system and to strong, healthy communities, families, and youth through integrated research, analysis and education.","Description":"K-State Research and Extension improves Kansans\u0027 lives, livelihoods and communities through education, research, engagement and leadership. With scientists, educators and volunteers in each of the state\u0027s 105 counties, our professionals strive to make the university\u0027s research and scientific accomplishments accessible and relevant to every household.","LinkVolunteer":"https://lp.constantcontactpages.com/su/PghmnZg","LinkWebsite":"www.wyandotte.k-state.edu","LinkWishlist":"https://a.co/a1UHU1j","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/201.png","City":"Kansas City","State":"KS","Lat":39.11819839477539,"Lng":-94.76460266113281},{"Id":202,"Name":"Pieces Peaces","Address":"2730 highland ave","ZipCode":"64109","Phone":"8167456591","Email":"shemiathomas@piecespeaces.org","ContactName":"Shemia Thomas","Mission":"Helping individuals pick up the Pieces of their life to get Peace in their life.","Description":"A local nonprofit that runs a program that offers a stable home environment for homeless individuals in recovery, coming home from incarceration, and veterans looking for housing.","LinkVolunteer":"http://Www.piecespeaces.org","LinkWebsite":"http://Www.piecespeaces.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/Z2F5KGWCM4LS?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/202.jpg","City":"Kansas city","State":"MO","Lat":39.07640075683594,"Lng":-94.56320190429688},{"Id":203,"Name":"A Loving Space Foundation","Address":"2420 N 37th St","ZipCode":"66104","Phone":"9133575737","Email":"alovingspacefoundation@gmail.com","ContactName":"Tamara Barnes","Mission":"Dignity, integrity, and compassion are the three core beliefs of A Loving Space Foundation. Provoking change through eco-environmental awareness. Supporting underrepresented communities by creating affordable housing, health (mental and physical) care and educational programming. While establishing resiliency through our communities and empowering love.","Description":"To grow with the generations to come and provide an everlasting experience to all involved. Help keep the esthetics and livelihood of the communities vibrant, by providing services that touch all walks of life.\n","LinkVolunteer":"https://www.alovingspacefoundation.com/contact","LinkWebsite":"http://www.alovingspacefoundation.com","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/203.jpg","City":"Kansas City","State":"KS","Lat":39.13309860229492,"Lng":-94.67250061035156},{"Id":204,"Name":"Goodwill of Western Missouri and Eastern Kansas","Address":"800 E 18th Street","ZipCode":"64108","Phone":"8165821763","Email":"cfoster@mokangoodwill.org","ContactName":"Carmen Foster","Mission":"Goodwill empowers people to discover their potential and adapt for the future through the power of work.  ","Description":"Goodwill empowers people to discover their potential and adapt for the future through the power of work. Our model provides services throughout the entire employment continuum; we support individuals in engaging the workforce, retaining work, gaining skills, and advancing their careers. In 2022, our organization assisted 1,797 individuals, providing nearly 9,000 services and securing jobs for 700 people. We strive towards our vision of building sustainable and prosperous communities.\n\nGoodwill provides workforce development services, job training, and employment in 82 counties across western Missouri and eastern Kansas, focusing our programs in the following counties: Jackson, Clay, Platte, Wyandotte, and Johnson. We support individuals with different abilities and disadvantaging conditions, such as persons with physical challenges or cognitive disorders, limited education and work history, criminal backgrounds, underemployment or unemployment, or a situational barrier such as lack of transportation or housing.\n\nWe believe every person deserves the opportunity to work. Employment is more than a paycheck. It is independence, agency, dignity, and equality. Jobs empower people to support themselves and their loved ones, pursue life goals, and participate in their communities. \n\nGoodwill impacts lives through four strategies customized to meet participants’ unique needs:\n\n- Our donated goods retail model provides employment, career planning, and upskilling through the recycling and reselling of material donations in our stores. \n- Our commercial and government contracts offer case management and employment for individuals with a different ability. \n- Our employment services and workforce development programs provide job training, wraparound services, digital skills training, career placement, and ongoing retention support for people with severe barriers to employment.\n- Our Goodwill Artemis Institute provides classroom training and on-the-job learning experiences to prepare job seekers for the technology-based careers created by the Fourth Industrial Revolution. ","LinkVolunteer":"https://form.jotform.com/231526802691153","LinkWebsite":"http://www.mokangoodwill.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/204.png","City":"Kansas City","State":"MO","Lat":39.09170150756836,"Lng":-94.57360076904297},{"Id":205,"Name":"Maze Foundation","Address":"7900 COLLEGE BLVD STE 100","ZipCode":"66210","Phone":"8168766815","Email":"mazefoundationforkids@gmail.com","ContactName":"Jy Maze","Mission":"To provide new coats and clothing to children in need to build confidence and joy. ","Description":"Every year we host a drive for BRAND NEW coats for children in need ages 3-18. boys and girls. We support various organizations where the children are housed such as KVC, Halo Foundation, 10.18 Strategy, Restart, Big Brothers Big Sisters, various schools, etc..","LinkVolunteer":"","LinkWebsite":"www.themazefoundation.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/205.png","City":"Overland Park","State":"KS","Lat":38.92829895019531,"Lng":-94.67759704589844},{"Id":206,"Name":"Hope Faith - Homeless Assistance Campus","Address":"705 Virginia Ave","ZipCode":"64106","Phone":"8162986134","Email":"brittni@hopefaith.org","ContactName":"Brittni Holland","Mission":"Hope Faith-Homeless Assistance Campus works to alleviate homelessness and poverty in Kansas City, Missouri by providing basic necessities and assistance, as well as, providing critical services and programs to empower individuals experiencing homelessness and at-risk individuals.","Description":"Hope Faith is the only collaborative, daytime outreach facility in Kansas City, Missouri providing direct services to individuals experiencing homelessness and at-risk individuals, families, and youth. Hope Faith provides for immediate needs such as food, showers, clothing, laundry service, and other essential services. The Day Center is in continuous collaboration with external partners and service providers to offer the best possible solutions to empower individuals and break the cycles of homelessness and poverty.","LinkVolunteer":"www.hopefaith.org/volunteer","LinkWebsite":"hopefaith.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2EHES8DWA562A?ref_=list_d_wl_lfu_nav_2","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/206.jpg","City":"Kansas City","State":"MO","Lat":39.104801177978516,"Lng":-94.56580352783203},{"Id":207,"Name":"Welcome House Inc.","Address":"1414 E 27th St.","ZipCode":"64108","Phone":"8164720760","Email":"jasonhurd@welcomehousekc.org","ContactName":"Karena Jensen/ Jason Hurd","Mission":"Welcome House is committed to providing a high-quality, moral, and open residential program to recovering alcoholics and drug-addicted men facing the difficult transition from treatment, incarceration, and homelessness, to reintegration to society as productive citizens.","Description":"Welcome House is a nationally recognized model with a residential sober living recovery program that empowers recovering men to live meaningful and productive lives.","LinkVolunteer":"","LinkWebsite":"welcomehousekc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/207.jpg","City":"Kansas City","State":"MO","Lat":39.077999114990234,"Lng":-94.56590270996094},{"Id":208,"Name":"Pawsperity","Address":"5805 Troost Ave.","ZipCode":"64110","Phone":"8164291770","Email":"sredinger@pawsperity.org","ContactName":"Sharon Redinger","Mission":"Pawsperity is a non-profit whose mission is to help struggling parents and young adults break the cycle of generational poverty through job skill development in the field of pet grooming and wrap-around services that help eliminate barriers to success.","Description":"Pawsperity, formerly known as The Grooming Project, is a unique non-profit that trains struggling parents and young adults in the high-demand field of pet grooming. Our extensive program teaches students pet grooming, as well as essential life skills, so they have the confidence, courage and financial stability to transform their lives. \n\nFor many, this means moving on from abusive relationships, addiction, or trauma to regain custody of their kids, establish a home and feel the joy of being able to buy school clothes, or play in a band, or cuddle with a beloved pet at the end of the day.  \n\nWe provide a variety of wrap-around services to support students and recent graduates through this transition, including helping students and their families secure adequate food, clothing, housing, and household goods. \n\nFounded just 7 short years ago, Pawsperity has already had immense success transforming the lives of impoverished families. With our recent rebrand and move into a beautiful new facility, we’re rapidly expanding to serve even more students.  \n\nIn addition to the non-profit Grooming School, Pawsperity now operates a Doggie Daycare and two professional grooming salons staffed by program graduates, The Salon in Kansas City and The Salon in Lee’s Summit. Revenue generated from these businesses supports the organization\u0027s mission, so we can be less reliant on grants. ","LinkVolunteer":"https://www.volgistics.com/appform/1435804303","LinkWebsite":"pawsperity.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/1F82Z57VFCPQX?ref_=wl_share","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/208.jpg","City":"Kansas City","State":"MO","Lat":39.02130126953125,"Lng":-94.57379913330078},{"Id":209,"Name":"Apostolic Assembly Faith in Christ Jesus ","Address":"3537 N 35th St ","ZipCode":"66104","Phone":"9137012619","Email":"mkrepairs913@gmail.com","ContactName":"Bulmaro Valencia ","Mission":"Our Mission is to evangelize and our fruits are the souls that come to Christ. ","Description":"We are a Christian faith based Apostolic Church. We serve both the English \u0026 Spanish speaking community. We are still newly established on the Kansas City Kansas side, now going on 6 years. Our previous church was in Independence MO and collapsed during Vacation Bible School summer of 2014. ","LinkVolunteer":"","LinkWebsite":"","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/209.png","City":"Kansas City ","State":"KS","Lat":39.1515007019043,"Lng":-94.66899871826172},{"Id":210,"Name":"Wyandot Behavioral Health Network","Address":"757 Armstrong","ZipCode":"66101","Phone":"9132333307","Email":"craig.doane@wyandotbhn.org","ContactName":"Craig M Doane","Mission":"Our Mission \nHelping people with mental health needs thrive. \nOur Vision \nHealthy Minds. Healthy Lives. Thriving Community. \n","Description":"For nearly 70 years, Wyandot Behavioral Health Network has been serving the behavioral health needs of Wyandotte County, Kansas, and beyond. Our commitment to serving children, adults and families began in 1953 as the Wyandotte County Child Guidance Center. Four years later, we expanded our services to include adults, as well as children. Since then, Wyandot Behavioral Health Network’s family of organizations has grown to include Wyandot Center, serving adults; PACES, serving children and families; RSI, providing 24/7/365 crisis stabilization services; and Kim Wilson Housing, providing housing solutions and support services for individuals facing homelessness.\n\nOver the past seven decades, our mission and purpose has not changed. We are here to help people with mental health needs thrive. We strive to provide trauma-informed, person-centered, culturally competent care to children, adults and families.","LinkVolunteer":"","LinkWebsite":"https://www.wyandotbhn.org/","LinkWishlist":"https://www.wyandotbhn.org/wish-list","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/210.png","City":"Kansas City","State":"KS","Lat":39.11429977416992,"Lng":-94.62930297851562},{"Id":211,"Name":"Disabled American Veterans","Address":"PO Box 32850","ZipCode":"64171","Phone":"8169604621","Email":"chandrar@teamthrift.com","ContactName":"Chandra Regan","Mission":"Empowering veterans to lead high-quality lives with respect and dignity. We accomplish this by ensuring that veterans and their families can access the full range of benefits available to them.","Description":"This mission is carried forward by:\n\nProviding free, professional assistance to veterans and their families in obtaining benefits and services earned through military service and provided by the Department of Veterans Affairs (VA) and other agencies of government.\nProviding outreach concerning its program services to the American people generally, and to disabled veterans and their families specifically.\nRepresenting the interests of disabled veterans, their families, their widowed spouses and their orphans before Congress, the White House and the Judicial Branch, as well as state and local government.\nExtending DAV’s mission of hope into the communities where these veterans and their families live through a network of state-level Departments and local Chapters.\nProviding a structure through which disabled veterans can express their compassion for their fellow veterans through a variety of volunteer programs.","LinkVolunteer":"","LinkWebsite":"http://www.redracksthriftstores.com","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/211.png","City":"Kansas City","State":"MO","Lat":39.00299835205078,"Lng":-94.5},{"Id":212,"Name":"Faceless Angels ","Address":"2504 NW salem ct","ZipCode":"64015","Phone":"8168309266","Email":"esottoriva@yahoo.com","ContactName":"Ed Sottoriva","Mission":"Our mission is to create a better day and a better way of life for those in need. ","Description":"Faceless Angels is a non-for-profit brand and organization dedicated to providing support and hope to individuals and families who have been overlooked and left behind by society. We strive to uplift them from anonymity. ","LinkVolunteer":"","LinkWebsite":"https://www.facebook.com/profile.php?id=61551034354385\u0026mibextid=LQQJ4d","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/212.jpg","City":"Blue Springs","State":"MO","Lat":39.028499603271484,"Lng":-94.29299926757812},{"Id":213,"Name":"Miracle of Innocence","Address":"13725 Metcalf Ave. #285","ZipCode":"66223","Phone":"9137175080","Email":"info@miracleofinnocence.org","ContactName":"Valerie Burton","Mission":"We help free \u0026 care for Innocent inmates in prison.","Description":"Since July 2017, Miracle of Innocence has helped free four innocent men and women. Miracle of Innocence supports retrials for incarcerated individuals and continuously provides care for the exonerated when they return back into society. State departments of corrections and reentry programs do not have adequate assistance when they are freed. With your help, Miracle of Innocence is able to help provide these individuals with the following care services: habitation, identification, communication, transportation, occupation, mental health counseling, adult mentorship, food, and clothing.","LinkVolunteer":"","LinkWebsite":"https://www.miracleofinnocence.org/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/213.jpg","City":"Overland Park","State":"KS","Lat":38.87990188598633,"Lng":-94.66739654541016},{"Id":215,"Name":"Creative Emajinations ","Address":"500 Delaware Street ","ZipCode":"64105","Phone":"8165501391","Email":"ce816kids@gmail.com","ContactName":"Ophelia Brinkley ","Mission":"At Creative Emajinations, we are dedicated to providing mentorship and arts education to underserved children. Our mission is to inspire and empower through creativity, fostering a supportive environment where every child can thrive and discover their unique potential.","Description":"Our services revolve around the dedicated efforts of volunteers and skilled professionals who collaborate to provide mentorship and arts education to underserved children. Our programs are designed to create a supportive environment where each child can flourish through personalized guidance and creative exploration. With the assistance of our committed volunteers and professionals, we aim to empower young minds, unlocking the transformative potential of the arts and fostering a brighter future for every child in our community.","LinkVolunteer":"https://www.ce816kids.org/donate.html","LinkWebsite":"www.ce816kids.org ","LinkWishlist":"https://a.co/41Qcssx ","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/215.png","City":"Kansas City ","State":"MO","Lat":39.1077995300293,"Lng":-94.58419799804688},{"Id":216,"Name":"Band of Angels","Address":"11890 W. 135th St. ","ZipCode":"66221","Phone":"7073159336","Email":"andrewlevi@bandofangels.org","ContactName":"Andrew Levi","Mission":"Band of Angels is a charity that addresses financial barriers students involved in music face by providing band and orchestra instruments, music camp and college scholarships, and follow-up support to children in need.","Description":"Band of Angels main function is to receive used, donated musical instruments from the community, refurbish them to as new as possible, and donate them to kids who come from families that are unable to afford them.  We also provide scholarships to music camps, college for music programs, and an expanding list of other opportunities.    ","LinkVolunteer":"https://bandofangels.org/volunteer/","LinkWebsite":"https://bandofangels.org/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/216.png","City":"Overland Park","State":"KS","Lat":38.88669967651367,"Lng":-94.72309875488281},{"Id":225,"Name":"Johnson County Christmas Bureau","Address":"11670 Grant Dr","ZipCode":"66210-1979","Phone":"9134818259","Email":"debmcpheter@gmail.com","ContactName":"Deb McPheter","Mission":"Provide warmth and support, during the winter holiday season to low-income Johnson County, Kansas families.\nIncrease awareness and understanding of poverty in Johnson County, Kansas; and\nGive neighbors an outlet to help neighbors.","Description":"One of our fundraisers is a charity auction where we have Christmas Trees, Wreaths and other decor for auction, all proceeds go to funding our holiday shop for over 3,000 families (13,000 people) of Johnson County. Perhaps there are Holiday Items donated to you that we can repurpose.","LinkVolunteer":"https://jccb.org/volunteer-1","LinkWebsite":"https://jccb.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2S4NYP9UDA4VY?ref_=list_d_wl_lfu_nav_6 ","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/225.jpg","City":"Overland Park","State":"KS","Lat":38.91680145263672,"Lng":-94.69200134277344},{"Id":226,"Name":"CIRCUL KC","Address":"PO BOX 11615 ","ZipCode":"64138","Phone":"8167037815","Email":"info@thecirculkc.org","ContactName":"Jackie Lehnert ","Mission":"SERVING AS JESUS SERVED US. We have several Mission Projects: Grandparents Closet, FETCH, Litter League, Flowers for Mom, Donuts and Dad\u0027s, Golden Years, Friends of Veterans, Not Forgotten and our Youth Enrichment Program.","Description":"Grandparents Closet collects it\u0027s for Senior Citizens and gives them to them for FREE. Items like: Medical equipment, clothing, seasonal items, purses, socks, underwear/ briefs, activity books, stationary along with dementia coping items like baby dolls, costume jewelry. \nFetch Project collects items for local animal shelters/rescues. Like collars kitty litter, food towels, blankets, toys etc\nLitter League collects items to help clean up our environment like trash bags, trash picking tools, gloves, shovels, brakes, etc\nFlowers for Mom collects fresh flowers on Mother\u0027s Day to give to Mother\u0027s in local nursing homes.\nDonuts and dads collects donuts for Father\u0027s Day to give to Dad\u0027s in local nursing homes.\nGolden years is our project dedicated to senior citizens who want to give back to the community and help our youth and our workshops from teaching them to sew, knit, hunt, cook and other skills that are youth today are not learning in school.\nFriends of Veterans is our project dedicated to veterans in nursing homes and in our community. \nNot Forgotten collects fake flowers and grave site vases. Volunteers clean up grave sites that have become overgrown with weeds and place a vase and flowers on each one. \nAre you then Youth Enrichment program is always seeking old laptops, tablets, school supplies etc. \n","LinkVolunteer":"https://form.jotform.com/232910982351153","LinkWebsite":"www.thecirculkc.org","LinkWishlist":"Donations - Amazon Gift List - https://www.amazon.com/registries/gl/guest-view/3IC226K6C8TMO","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/226.jpg","City":"Kansas City ","State":"MO","Lat":39.00400161743164,"Lng":-94.5},{"Id":227,"Name":"City Union Mission","Address":"1100 E 11th Street","ZipCode":"64106","Phone":"8168416180","Email":"karla.schuning@cityunionmission.org","ContactName":"Karla Schuning","Mission":"City Union Mission is an evangelical Christian ministry committed to sharing the gospel and meeting the spiritual, physical and emotional needs of men, women and children who are poor or homeless.","Description":"We show compassion to everyone who walks through our doors, and we do it with love, patience and understanding. Our commitment to Serve others extends to the men, women and children in Kansas City. We work diligently to help empower them to relieve the challenges they face each and every day. \nWe are committed to uncompromisingly share the gospel and improve lives in Kansas City since 1924. By providing the essentials, emotional guidance, youth service and community assistance, we continue to provide hope to all those in need. \nWe are transformative. It is through God’s gifts that we are able to transform the lives of the poor or homeless in Kansas City by taking away barriers to help individuals help themselves. We seek for all individuals to achieve stability through the spiritual, physical, emotional, social and vocational resources that the Mission provides.","LinkVolunteer":"https://cityunionmission.org/ways-to-help/volunteer/","LinkWebsite":"https://cityunionmission.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/VKOKAVSSITB6?ref_=wl_fv_le","Pickup":true,"Dropoff":true,"Resell":true,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/227.png","City":"Kansas City","State":"MO","Lat":39.10110092163086,"Lng":-94.56950378417969},{"Id":228,"Name":"Sunflower Knitters","Address":"P.O. Box 13464","ZipCode":"66282","Phone":"9135446791","Email":"skgkcpresident@gmail.com","ContactName":"Heather Rischar","Mission":"Later","Description":"Later","LinkVolunteer":"","LinkWebsite":"https://www.sunflowerknitters.org/","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/228.png","City":"Overland Park","State":"KS","Lat":39.005001068115234,"Lng":-94.5},{"Id":230,"Name":"Heartland Conservation Alliance","Address":"6601 E. 93rd St.","ZipCode":"64138","Phone":"8169458505","Email":"jess@heartlandconservationalliance.org","ContactName":"Jessica Hartel","Mission":"The Heartland Conservation Alliance works with partners to protect, connect, and restore the Blue River watershed and its urban greenspaces for the benefit and enjoyment of all.","Description":"We envision a sustainable environment that supports the health of all human and natural communities in the Kansas City region. Heartland Conservation Alliance is committed to restoring and protecting this valuable natural resource, and engaging communities throughout the Blue River Watershed.","LinkVolunteer":"https://www.heartlandconservationalliance.org/calendar/","LinkWebsite":"https://www.heartlandconservationalliance.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/27OG80QTVVKFE?","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/230.jpg","City":"Kansas City","State":"MO","Lat":38.9556999206543,"Lng":-94.51280212402344},{"Id":231,"Name":"Habitat For Humanity of Kansas City ReStore","Address":"1423 E Linwood Blvd","ZipCode":"64109","Phone":"2187917533","Email":"shanson@habitatkc.org","ContactName":"Scott a Hanson","Mission":"Every donation helps a family build a decent and affordable home. ","Description":"Do you have furniture, working appliances or building supplies that you no longer need? Don’t pay disposal fees. We pick up donations for free! Your donation helps local families build decent and affordable homes.","LinkVolunteer":"https://habitatkc.org/volunteer-opportunities-in-kansas-city/","LinkWebsite":"restorekc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/231.jpg","City":"Kansas City","State":"MO","Lat":39.06809997558594,"Lng":-94.56590270996094},{"Id":232,"Name":"The Kansas City Free Eye Clinic","Address":"705 Virginia Avenue","ZipCode":"64106","Phone":"8162986185","Email":"kaitlin@kcfreeeyeclinic.org","ContactName":"Kaitlin Dempsey","Mission":"The Kansas City Free Eye Clinic helps low-income and homeless people in the metro area with access to preventive eye exams and glasses ensuring that sight-robbing eye disease and blurry vision don\u0027t prevent someone from taking advantage of every opportunity.","Description":"Our long-term focus is to prevent vision loss from placing significant, lifelong burdens on someone else. An eye exam detecting underlying and asymptomatic eye disease is the first step in prevention and most often not obtained until it’s too late.\n\nOur short-term focus is to enhance daily life through clear vision. We use glasses to eliminate blurry and distorted vision so someone can take advantage of every educational and employment opportunity and enjoy the sights many of us take for granted.","LinkVolunteer":"","LinkWebsite":"http://www.kcfreeeyeclinic.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/232.png","City":"Kansas City","State":"MO","Lat":39.104801177978516,"Lng":-94.56580352783203},{"Id":233,"Name":"Lead to Read KC","Address":"Nonprofit Village, 31 W. 31st St.","ZipCode":"64108","Phone":"8166653672","Email":"linda@leadtoreadkc.org","ContactName":"Linda Hughes","Mission":"Our mission is the support the social, emotional and reading skills that are foundational to student success by advancing our literacy platform and mobilizing community volunteers.","Description":"Lead to Read KC is a children\u0027s literacy nonprofit working to tackle low literacy rates in the greater Kansas City area. We mobilize community volunteers, called Reading Mentors, to read one-to-one with students in first - third grades. We offer a high-dosage tutoring program, and author partnership program and a robust book distribution program, called Reading is Everywhere, where we place baskets of books in places where children are waiting. With over 6o locations, we are always in need of books in good condition!","LinkVolunteer":"https://www.leadtoreadkc.org/apply/","LinkWebsite":"www.leadtoreadkc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/7S0RP80V48FA?ref_=abls_nvfly_yl","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/233.jpg","City":"Kansas City","State":"MO","Lat":39.07080078125,"Lng":-94.58679962158203},{"Id":234,"Name":"The Nia Project ","Address":"PO Box 300731","ZipCode":"64130","Phone":"8166739018","Email":"terri@theniaprojectkc.org","ContactName":"Terri Barnes ","Mission":"To support projects that build confidence, capacity and opportunity for Black girls and women","Description":"​The Nia Project will work to change the perception, outcomes and norms for Black girls and women in our community and in our country.","LinkVolunteer":"","LinkWebsite":"www.theniaprojectkc.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/234.png","City":"Kansas City","State":"MO","Lat":39.00600051879883,"Lng":-94.5},{"Id":235,"Name":"Grandview Park Presbyterian Church","Address":"1613 Wilson Blvd. ","ZipCode":"66102","Phone":"8168076931","Email":"grandviewparkpc@gmail.com","ContactName":"Rick Behrens","Mission":"We seek to serve as a community of faith, spiritually connected to the neighborhood around us, reflecting the diversity of neighborhood in a church that is FULK!","Description":"Grandview Park is a bi-lingual, multicultural urban congregation serving in the Central Avenue neighborhood of Kansas City, KS.","LinkVolunteer":"","LinkWebsite":"grandviewpark.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/235.jpg","City":"Kansas City","State":"KS","Lat":39.10380172729492,"Lng":-94.64779663085938},{"Id":236,"Name":"Hearing Aid Project, a program of Sertoma","Address":"720 Main St, Floor 1","ZipCode":"64105","Phone":"8163338300","Email":"jcamis@sertoma.org","ContactName":"Jason Camis","Mission":"The Hearing Aid Project provides essential support to eligible individuals with hearing loss by offering hearing aids at no cost, enabling them to stay connected with their communities and enhance their quality of life.","Description":"The Hearing Aid Project (HAP), a program of Sertoma International, is a national nonprofit initiative dedicated to providing free hearing aids to qualifying low-income individuals who cannot otherwise afford them. By collecting donated hearing aids, refurbishing them to like-new condition and working with a network of hearing health professionals, the program breaks down barriers to hearing healthcare in the United States. In addition, the project supplies hearing aids for use on international medical mission trips, extending the reach of hearing care to underserved communities around the world. Through collaborative partnerships, donor support and community outreach, HAP helps restore the gift of sound to those in need—improving communication, health and overall quality of life. To learn more or get involved, visit HearingAidDonations.org or Sertoma.org.","LinkVolunteer":"https://hearingaiddonations.org/donations/","LinkWebsite":"http://www.hearingaiddonations.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/236.png","City":"Kansas City","State":"MO","Lat":39.104801177978516,"Lng":-94.58399963378906},{"Id":237,"Name":"Lorraine’s House","Address":"PO Box 2379","ZipCode":"66205","Phone":"9134860975","Email":"lhsoberhouse@gmail.com","ContactName":"Lucy Brown","Mission":"To help women recover and heal. To assist in housing and support. Providing a safe and trauma informed environment.","Description":"Sober living program for recovering women","LinkVolunteer":"","LinkWebsite":"https://lorraineshouse.org/","LinkWishlist":"Lorraine’s House - Amazon Gift List - https://www.amazon.com/registries/gl/guest-view/1NWEIPC6EO702","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/237.jpg","City":"Mission","State":"KS","Lat":39.00699996948242,"Lng":-94.5},{"Id":238,"Name":"Magpie Creative Reuse Collective","Address":"1522 Holmes St.","ZipCode":"64108","Phone":"9139804777","Email":"info@magpiecreativereuse.org","ContactName":"Keli Campbell","Mission":"We are committed to mobilizing collective effort to keep things useful longer","Description":"Like all magpies, we are collectors. Our focus is collecting and reselling leftover and remnant material, and providing education and resources to encourage reuse. Everything we do is centered on using collective effort to keep things useful longer.  \nOur three goals are: \n1) providing resources for material reuse: maximizing the usefulness of materials by mobilizing staff, volunteers and partners to collect, process and resell used or remnant items\n2) Education: teaching skills and processes related to reuse, upcycling, downcycling, recycling and repairing to conserve resources, divert waste, and retain value of materials \n3) Innovation: leading, collaborating and inspiring creative approaches to the environmental problem of material waste, specifically by supporting artists, makers and small business owners. \n\nDonation Drop Off: Sundays 12-3pm or Wednesdays 3-6pm at Arts Tech KC","LinkVolunteer":"https://magpiecreativereuse.org/donate/donate-time/","LinkWebsite":"http://www.magpiecreativereuse.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/238.png","City":"Kansas City","State":"MO","Lat":39.09469985961914,"Lng":-94.57559967041016},{"Id":242,"Name":"Bishop Sullivan Center","Address":"3936 Troost Avenue","ZipCode":"64110","Phone":"8164427272","Email":"hannah.brockway@bishopsullivan.org","ContactName":"Hannah Brockway","Mission":"Inspired by Christian faith, Bishop Sullivan Center shows God’s love to people in financial hardship by providing food, help in finding jobs and other aid.\nAll of our programs are part of our three pillars: Food, Jobs, and Aid to support our community and improve the lives of all who live here.","Description":"For more than half a century, Bishop Sullivan Center has worked to lighten the load for\nneighbors in need. With two locations in Kansas City\u0027s urban core– one in Midtown\nKC, and one in the historic Northeast – we’re working to meet the changing needs our\nneighbors face with a focus on affirming the dignity of all.","LinkVolunteer":"https://www.bishopsullivan.org/volunteer/","LinkWebsite":"www.bishopsullivan.org","LinkWishlist":"https://a.co/imwVRQe","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/242.jpg","City":"Kansas City","State":"MO","Lat":39.0547981262207,"Lng":-94.57240295410156},{"Id":243,"Name":"Uplift Organization","Address":"1516 Prospect Ave","ZipCode":"64127","Phone":"7855510401","Email":"rossd@uplift.org","ContactName":"Ross Dessert","Mission":"Taking Care \u0026 Compassion to the Homeless","Description":"Uplift Organization is a mobile street outreach for the homeless of Kansas City. Three nights a week, we take four Sprinter vans loaded with food, clothing, and other essential supplies out to the homeless. We meet them at parks, under bridges, at their camps, or wherever they are. We typically serve 250-400 people each night and we never miss a night! \n\nUplift was started 34 years ago in 1990. We are 100% donation-based and run completely by volunteers. Uplift is not affiliated with any particular church or religious organization. Uplift believes in the power of unconditional love and kindness. We welcome all people of good will to join us in this work!","LinkVolunteer":"www.uplift.org","LinkWebsite":"www.uplift.org","LinkWishlist":"www.uplift.org","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/243.png","City":"Kansas City","State":"MO","Lat":39.09410095214844,"Lng":-94.552001953125},{"Id":244,"Name":"Heart of America Humane Society","Address":"P O Box 12703","ZipCode":"66282","Phone":"8003843143","Email":"donate@heartofamericahs.org","ContactName":"Laura Corbett","Mission":"To promote kindness to animals, prevent cruelty to animals, the extension of humane education, the encouragement of spay/neuter programs among individual pet owners \u0026 animals shelters, \u0026 the encouragement of programs designed to adopt approved animals held at approved animals shelters to the public.","Description":"Heart of America Humane Society is a 100% volunteer organization. We do not have a shelter facility. All of our animals are in foster homes. We hold adoption events on Saturdays at 3 area PetSmart locations (Olathe, Overland Park, Lee\u0027s Summit). We also partner with 2 area shelter (Lee\u0027s Summit Animal Shelter \u0026 Kansas City KS Animal Services) and host their animals at our Saturday adoption events along with our foster animals. We also have an Outreach Team that works to ensure that owners are provided with basic pet needs in order to keep their pets in their home with them rather than surrendering them to the already overcrowded area animal shelters. Finally, we have a TNR (trap, neuter, release) Team that work diligently to spay/neuter community/feral cats to strive to get control of the overpopulation problem in our area.","LinkVolunteer":"https://www.shelterluv.com/form/volunteer/HAUS/2336-volunteer-interest-form","LinkWebsite":"www.heartofamericahs.org","LinkWishlist":"https://a.co/8q754z6","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/244.png","City":"Overland Park","State":"KS","Lat":39.007999420166016,"Lng":-94.5},{"Id":245,"Name":"Journey to New Life","Address":"3120 Troost Ave","ZipCode":"64109","Phone":"8169604808","Email":"jhanlin@jtnl.org","ContactName":"Jill Hanlin","Mission":"Our mission is to create pathways for recently incarcerated people to overcome reentry barriers and live fulfilling lives.","Description":"Journey to New Life is a peer-led reentry program that guides individuals through the transition from incarceration to community integration by providing wrap-around services, including emergency assistance, housing assistance, case management, employment services, and peer support. Beyond direct assistance to individuals, we advocate for our clients in systems where they face discrimination and support policy reform in areas that directly impact their lives. Together, we navigate pathways toward lasting transformation and full societal reintegration.","LinkVolunteer":"","LinkWebsite":"www.journeytonewlife.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/245.png","City":"Kansas City","State":"MO","Lat":39.069698333740234,"Lng":-94.5718002319336},{"Id":246,"Name":"Seton Center","Address":"2816 E 23rd Street","ZipCode":"64127","Phone":"8165814720","Email":"chelsea.fernandez@setonkc.org","ContactName":"Chelsea Fernandez","Mission":"Seton Center is a human services agency that helps break cycles of poverty. Seton Center provides dental, social and educational programs to address current community needs, and tools to help support people in transforming their lives.","Description":"Seton Center is a human services agency that seeks to break the cycles of poverty and transform lives. Founded in 1969 as a collaborative project of the Daughters of Charity and the Ladies of Charity of Metropolitan Kansas City, Seton Center is now a Community Health Ministry of Ascension, one of the largest Catholic nonprofit health systems in the nation. We presently serve as a comprehensive community and neighborhood center meeting the needs of low-income adults, children, and seniors by addressing social determinants of health. The organization operates a full-service dental facility and offers a holistic suite of social service programming to meet basic needs. Located in Kansas City’s urban core, Seton Center targets ZIP codes with the lowest incomes and health rankings. All of Seton Center’s 5,825 clients (whom we call “neighbors”) from the last fiscal year had low to moderate incomes. Seton Center provides services to remove barriers, like language translation, transportation services, and sliding scale dental fees, to ensure the greatest access to our services. ","LinkVolunteer":"https://setonkc.org/volunteer/","LinkWebsite":"www.setonkc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/246.jpg","City":"Kansas City","State":"MO","Lat":39.084999084472656,"Lng":-94.54889678955078},{"Id":247,"Name":"Uzazi Village","Address":"4232 Troost Avenue","ZipCode":"64110","Phone":"8166178038","Email":"shivon@uzazivillage.org","ContactName":"Shiv\u0027on Bullock","Mission":"For every healthy family, a healthy baby, for every baby a healthy village","Description":"Uzazi Village is a nonprofit organization dedicated to eliminating maternal and infant health inequity among Black and Brown communities. Through education, support, and advocacy, Uzazi Village works to improve perinatal health in the Kansas City community and around the country. We work every day to build a respectful and supportive healthcare system that fosters equitable and sustainable outcomes in maternal and infant health.\nUzazi Village offers a free breastfeeding clinic, infant and maternity clothing from the Uzazi Boutique, empowered and informative childbirth education through our Sacred Birth Childbirth Education series, a group prenatal care clinic at the Ida Mae Patterson Center for Maternal and Infant Wellness, and facilitates transformative training to assist healthcare organizations to embrace anti-racist practice and culture.","LinkVolunteer":"https://forms.gle/UjP1oG8AAKJYkkT39","LinkWebsite":"www.uzazivillage.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/16ZJ1ZZIEPG8H?ref_=wl_share","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/247.jpg","City":"Kansas City","State":"MO","Lat":39.04949951171875,"Lng":-94.57279968261719},{"Id":250,"Name":"Little Free Libraries in Grandview Playgrounds","Address":"13210 Corrington Ave.","ZipCode":"64030","Phone":"4696002686","Email":"katherinebmiller@gmail.com","ContactName":"Katherine Maloney","Mission":"Our mission is to be a catalyst for building community, inspiring readers, and expanding book access for all through a global network of volunteer-led Little Free Library book-exchange boxes.","Description":"Our vision is a Little Free Library in every community and a book for every reader. We believe all people are empowered when the opportunity to discover a personally relevant book to read is not limited by time, space, or privilege.\n\nLocally, I have three little free libraries in the Grandview Parks \u0026 Rec playgrounds to provide free books to children in my local community. ","LinkVolunteer":"","LinkWebsite":"https://littlefreelibrary.org/map/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/250.png","City":"Grandview","State":"MO","Lat":38.88290023803711,"Lng":-94.51090240478516},{"Id":251,"Name":"Growth Ministries Inc","Address":"PO Box 4375","ZipCode":"66063","Phone":"9134249510","Email":"lonniejohnson@growthministriesinc.org","ContactName":"Lonnie Johnson","Mission":"Our mission is to lead individuals that have been incarcerated into becoming productive members of society.","Description":"We are a prison ministry providing a number of services to inmates during and after incarceration. ","LinkVolunteer":"","LinkWebsite":"https://www.growthministriesinc.org/","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/251.jpg","City":"Olathe","State":"KS","Lat":39.0099983215332,"Lng":-94.5},{"Id":252,"Name":"Hope House","Address":"P.O. Box 577","ZipCode":"64063","Phone":"8162579311","Email":"kheywood@hopehouse.net","ContactName":"Katie Heywood","Mission":"Hope House\u0027s Mission is to break the cycle of domestic violence by providing safe refuge and supportive services that educate and empower those impacted by domestic violence.\nHope House will advocate social change that protects and engenders a person\u0027s right to live a life free of abuse.","Description":"Domestic violence can happen to anyone, no matter their gender, age, race, ethnicity, religion, or sexuality. Hope House advocates for survivors, no matter where they are in their journey.  With your help, we can build a brighter future for those impacted by abuse.  Hope House is proud to have served thousands of individuals in over 40 years of operation.  We continue to provide essential services to survivors of domestic violence in our community, and offer hope, peace, and healing to all who walk through our doors.","LinkVolunteer":"https://docs.google.com/forms/d/e/1FAIpQLSfn1NAhyxOtnAV_SBLQ1PFk4_7V10koQuN6JRCet6AsldF-Yg/viewform","LinkWebsite":"https://www.hopehouse.net","LinkWishlist":"https://www.amazon.com/registries/gl/guest-view/2A0FYDTY1A3NY","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/252.png","City":"Lee\u0027s Summit","State":"MO","Lat":39.01100158691406,"Lng":-94.5},{"Id":253,"Name":"Northland Clothing Center","Address":"P.O. Box 46625","ZipCode":"64188","Phone":"8164543960","Email":"ed@northlandclothingcenter.org","ContactName":"Marjie Siegfried-Stuber","Mission":"Northland Clothing Center contributes to the dignity, self-respect, and hope of people residing in the Kansas City (MO) Northland by distributing clothing free of charge.","Description":"Individuals and families are referred to us by school social workers, shelters, social services agencies, churches, and other organizations that offer services to people in need. We provide a personal shopper experience for clients, who are scheduled by their referral agents, and they are able to select clothing (hats to shoes and everything in between) that they like, feel comfortable wearing, and need. Most of our clients leave NCC with 40-60 items of clothing. NCC was founded in 1959, and we serve about 3000 people each year in the Northland KC (MO) area, defined as \u0022north of the Missouri River.\u0022 We partner with almost 100 agencies, schools, and other entities who identify and then refer clients to us.","LinkVolunteer":"https://www.northlandclothingcenter.org/volunteer","LinkWebsite":"https://www.northlandclothingcenter.org","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/253.jpg","City":"Kansas City","State":"MO","Lat":39.012001037597656,"Lng":-94.5},{"Id":254,"Name":"Hillcrest Transitional Housing","Address":"Po Box 901924","ZipCode":"64190","Phone":"9135582885","Email":"csandoval@hillcrestkc.org","ContactName":"Candice Sandoval","Mission":"To be a transitional housing program that helps move homeless families and youth from homelessness to self-sufficiency, becoming self-supporting, self-reliant contributors of society.","Description":"Hillcrest Transitional Housing moves individuals, youth, and families from homelessness to self-sufficiency in the greater Kansas City area. We achieve this by addressing the root causes of homelessness, providing essential life skills, budget counseling, and enforcing accountability through weekly evaluations, strict budgeting, sobriety, and full-time employment. Hillcrest Transitional Housing owns and operates two not-for-profit thrift stores located in Overland Park, KS (12202 College Blvd, Overland Park, KS 66210) and Lee\u0027s Summit, MO (936 SE 3rd St, Lee’s Summit, MO 64063) that directly fund our housing programs and services.","LinkVolunteer":"https://hillcrestkc.volunteermatters.org/project-catalog","LinkWebsite":"https://hillcrestkc.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/3ADH65LC1F49X/ref=hz_ls_biz_ex","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/254.png","City":"Kansas City","State":"MO","Lat":39.01300048828125,"Lng":-94.5},{"Id":257,"Name":"Synergy Services","Address":"2001 NE Parvin Road","ZipCode":"64116","Phone":"8164572900","Email":"aparragrooms@synergyservices.org","ContactName":"Anissa Parra-Grooms","Mission":"We take action to create a community free of family violence.","Description":"Our services and resources make safety, healing, and hope all possible. And we walk with you from the first phone call to a place of restoration on the other side.","LinkVolunteer":"anissa@synergyservices.org ","LinkWebsite":"https://www.synergyservices.org","LinkWishlist":"https://a.co/hSirIaQ","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/257.png","City":"Kansas City","State":"MO","Lat":39.167198181152344,"Lng":-94.55509948730469},{"Id":258,"Name":"Alyssa\u0027s Wishes","Address":"2108 NE Concord St","ZipCode":"64086","Phone":"5163124725","Email":"mominthecty@att.net","ContactName":"Karen Houck","Mission":"Alyssa\u0027s Wishes is dedicated to preserving the memory of Alyssa Noelle Audette. It focuses on achieving this goal through acts of kindness, fostering community connections, and promoting literacy.","Description":"Our family facilitates a Little Free Library and a Kindness Rocks Garden in honor of my daughter Alyssa Noelle Audette.\n\nFor more information please visit www.alyssaswishes.org","LinkVolunteer":"","LinkWebsite":"http://www.alyssaswishes.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/JPMEVXEOOU78?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/258.jpg","City":"Lee\u0027s Summit","State":"MO","Lat":38.924400329589844,"Lng":-94.3323974609375},{"Id":259,"Name":"Pretty’s village ","Address":"2651 e 34th st apt 113 ","ZipCode":"64109","Phone":"7252876743","Email":"sugavery2021@icloud.com","ContactName":"Shonna Hyman ","Mission":"Helping those in need that are less fortunate ","Description":"I give out clothes and. Cook food for the homeless.","LinkVolunteer":"725-207-6743 ","LinkWebsite":"","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2JRX7Z19TAQSC?ref_=wl_share","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/259.jpg","City":"Kansas City ","State":"MO","Lat":39.06370162963867,"Lng":-94.55280303955078},{"Id":264,"Name":"Cleanse KC","Address":"3405 NE 48TH TER ","ZipCode":"64119","Phone":"8167861485","Email":"cleansekc@outlook.com","ContactName":"Aaron Olson","Mission":"To provide clean showers, haircuts, food, clothes to the chronically homeless in Kansas City Area","Description":"I\u0027m following a vision God gave me... One to bring cleansing to the people that need it the most. There are some big goals to achieve to see this in action, and I trust God to fill the need through the people HE chooses. \nStep 1: Raise funds for the heated potable water truck that will provide mobile showers  for those in need the most. \nStep 2: Raise funds for the box truck needed to carry the mobile shower units, tables chairs, grills for cooking, used clothes, towels, and donations to disperse. \nStep 3: Getting volunteers for haircuts, cooking, handing out towels and clothes, people to share the word of God, and resource utilization for onsite work (Oxford house applications, EBT applications, government phone applications).\n\nI am brand new and all I have to work on is a vision, so anyone that can provide guidance or advice, I pray that God uses you to help me in this mission, please message with any helpful information or if you would like to be a part of this. \n\nPhilippians 4:19: \u0022My God will supply all your needs according to His riches in glory in Christ Jesus\u0022","LinkVolunteer":"https://www.facebook.com/profile.php?id=61571547512567\u0026mibextid=ZbWKwL","LinkWebsite":"https://www.facebook.com/profile.php?id=61571547512567\u0026mibextid=ZbWKwL","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/264.jpg","City":"Kansas City ","State":"MO","Lat":39.180999755859375,"Lng":-94.53919982910156},{"Id":265,"Name":"Birdsall House","Address":"3122 Harrison St","ZipCode":"64109","Phone":"8163522755","Email":"Birdsallhousekr@gmail.com","ContactName":"Kelly Raines","Mission":"The Birdsall House mission is to provide quality, respectful programs that help children and families be their best.  \nWe follow the philosophies of Magda Gerber, and Reggio Emilia, of respect for and trust in the child to be the initiator, explorer, and self-learner. We are here as facilitators.","Description":"The Birdsall House is a family childcare program located at 31st and Harrison in Kansas City, MO (one block west of Troost). In addition to Kelly, the organization employs an Assistant Director / Teacher and two additional teachers. The program currently serves 16 children: 4 infants, 2 toddlers, 6 preschool-aged children, and 4 school-age children who come in on the days school is closed. Today, families pay tuition based on the age of the child.\nThe organization has been recognized as a licensed early childhood center. The mission of Birdsall House is to provide quality, respectful childcare programs that help children and families be their very best. Birdsall House has been recognized as a Breastfeeding Friendly center and workplace, and as a Missouri Move Smart Center. \nThe Birdsall House curriculum pulls from the Reggio Approach, the teachings of Magda Gerber, Jean Piaget and many other theorists who support play. The curriculum focuses on positive interactions, the arts, and science. Kelly created an environment in which the children are free to learn and explore what they are interested in and to develop at their own pace. \nBirdsall House grows many different fruits, vegetables, and herbs in the outdoor classroom. Children are free to pick mulberries, raspberries, cherries, peaches, strawberries, mint, and whatever vegetables are in season. Everything grown in the outdoor classroom is edible, including the clover that covers the ground. \nBirdsall House inside classrooms are designed to encourage play that promotes social and emotional development. With a mix of open-ended toys, household items, and objects from nature, the children build, cook, dance, sing, and learn in a natural way. With an emphasis on science and the arts driving the curriculum, classrooms are rich in books, maps, musical instruments, dress up clothes, puppets, and art supplies.\n","LinkVolunteer":"","LinkWebsite":"https://Birdsallhouse.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/3C6OBDEUQMK5V?ref_=wl_share","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/265.jpg","City":"Kansas City","State":"MO","Lat":39.01900100708008,"Lng":-94.5},{"Id":266,"Name":"Global One Urban Farming","Address":"4409 Cypress Avenue ","ZipCode":"64130","Phone":"8162699203","Email":"globalonekc@gmail.com","ContactName":"Staroyce Nealy","Mission":"Global One Urban Farming is a 501 (c) (3) non-profit charitable organization that produces and distributes free organic vegetables to seniors, veterans, and low-income families in USDA defined food insecure and food desert areas. We also teach sustainable gardening skills and the greenhouse process.","Description":"We operate in an area of low-income families and a USDA defined food insecure community. There is no access to fresh fruits and vegetables. Global One Urban Farming is located at 44th and Cypress Avenue in\nKansas City, MO. in the center of a USDA defined food desert and food insecure\ncommunity. The goal of Global One Urban Farming, a 501c3 non-profit, is to provide\nfree, locally grown, fruits and vegetables to residents in need in our community,\n","LinkVolunteer":"https://www.jotform.com/form/220336441968156","LinkWebsite":"https://globaloneurbanfarming.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/266.jpg","City":"Kansas city","State":"MO","Lat":39.0452995300293,"Lng":-94.53189849853516},{"Id":267,"Name":"Learning Club of KCK","Address":"PO Box 171040","ZipCode":"66117","Phone":"9134290447","Email":"bvanhecke@learningclubkck.org","ContactName":"Brooke VanHecke","Mission":"Providing a positive, pivotal education experience for the children in Kansas City who need it most.\n","Description":"The Learning Club helps under-served children realize their full potential through one-on-one tutoring and mentoring as well as enriching activities designed to advance their academic achievement, social development, and leadership skills.  ​Located in the core of Kansas City, Kansas, we serve children and youth through in-school, after-school, and summer programs. By hosting 18 different programs for students K-12 each week, Learning Club reaches over 430 students each week through quality in-school and after-school programs. ","LinkVolunteer":"https://www.learningclubkck.org/volunteer.html","LinkWebsite":"https://www.LearningClubKCK.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/26J1ZLXSUH44K/ref=hz_ls_biz_ex?","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/267.png","City":"Kansas City","State":"KS","Lat":39.020999908447266,"Lng":-94.5},{"Id":268,"Name":"Blessings Abound","Address":"10325 Metcalf Ave","ZipCode":"66212","Phone":"9135483113","Email":"tonywhitter@gmail.com","ContactName":"Tony Whitter","Mission":"Blessings Abound funds other Kansas City Metro nonprofits","Description":"Donate to Blessings Abound who funds Operation Breakthrough, MLM, Hopebuilders, Flourish Furniture Bank, Mission Southside, Pete\u0027s Garden, and 30\u002B other Kansas City nonprofits.","LinkVolunteer":"https://blessingsaboundkc.org/volunteering","LinkWebsite":"https://blessingsaboundkc.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/268.png","City":"Overland Park","State":"KS","Lat":38.94029998779297,"Lng":-94.66560363769531},{"Id":269,"Name":"Coldwater of Lee\u0027s Summit","Address":"838  SW Blue Pkwy","ZipCode":"64063","Phone":"8167860758","Email":"director@coldwater.me","ContactName":"Monica Humbard","Mission":"Our mission is to build friendships that foster hope in our community while providing food and clothing for those in need.","Description":"We build friendships and foster hope by connecting with our neighbors and their needs. We operate a food pantry and a clothes closet, offer emergency food during the week and provide weekend backpacks for hungry school children. During the summer months, we offer a non-competitive T-ball program (League of Smiles) and summer lunches and bar-b-que dinners to local neighborhoods.","LinkVolunteer":"https://www.coldwater.me/volunteer","LinkWebsite":"https://www.coldwater.me/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/269.jpg","City":"Lee\u0027s Summit","State":"MO","Lat":38.909698486328125,"Lng":-94.39019775390625},{"Id":270,"Name":"Heart of the City Neighborhood Association, Inc.","Address":"PO BOX 300582","ZipCode":"64130-0582","Phone":"8166591575","Email":"heartofthecity.kc@gmail.com","ContactName":"Kathryn Persley","Mission":"To enhance the lives of people who live, work and visit the historic Dunbar neighborhood.  ","Description":"Heart of the City Neighborhood Association offers spearheads initiatives that lead to the growth and redevelopment of the Dunbar neighborhood through programs, projects and services that benefit Dunbar residents and stakeholders.  ","LinkVolunteer":"","LinkWebsite":"https://heartofthecitykc.org","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/270.jpg","City":"Kansas City","State":"MO","Lat":39.02399826049805,"Lng":-94.5},{"Id":271,"Name":"West iNd Connection dba WiNc Inclusion Center","Address":"10908 East Winner Road Independence, MO 64052","ZipCode":"64052","Phone":"8162004782","Email":"westindconnection@gmail.com","ContactName":"West iNd Connection, Tammy Parsons","Mission":"To create an inclusive, thriving place for the Eastern Jackson County community to come\ntogether and to provide a safe, supportive space for the LGBTQ\u002B community and its allies.","Description":"West iNd Connec;on envisions a thriving, inclusive community in Eastern Jackson County,\nMissouri, where we are a cornerstone of well-being, engagement among all community\nmembers, while suppor;ng diverse programs. With a dedicated staff, a robust volunteer\nnetwork, and a strong foundation, we will expand into a larger, self-sufficient space, maintain\nconsistent bookstore hours and achieve a Safe Space designation. By improving our reputation\nand creating lasting, positive change, we aim to empower individuals and families, shaping a\nbrighter, more connected future for all.","LinkVolunteer":"www.westindconnection.com","LinkWebsite":"https://www.westindconnection.com","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/271.png","City":"Independence","State":"MO","Lat":39.0880012512207,"Lng":-94.4489974975586},{"Id":272,"Name":"Hillcrest Transitional Housing ","Address":"1314 North 38th","ZipCode":"66102","Phone":"9133069202","Email":"bfitzgerald@hillcrestkc.org","ContactName":"Barb Fitzgerald ","Mission":"Hillcrest is a transitional housing program that helps homeless families become self-supportive, self-reliant contributors to society.","Description":"Reach us at: (816) 994-6934\nDONATE TODAY\n\nHillcrest Transitional Housing\nHillcrest is Solving Homelessness One Family at a Time\nHillcrest is a transitional housing program that helps homeless families become self-supportive, self-reliant contributors to society.\nehoHillcrest Transitional Housing offers homeless families, singles and youth a disciplined educational program within a caring, supportive environment. Unlike many organizations whose focus is one-time or emergency care, Hillcrest’s primary objective is to move clients from homelessness to self-sufficiency by addressing the total life situation of the homeless families they serve. At any given time, there are approximately 100 households in our care. Hillcrest provides:\n\nA transitional housing program that focuses on moving clients to self-sufficiency within a 90-day time frame.\nA 24-month youth housing program for homeless youth, ages 16 to 24.\nA rapid re-housing program for those in need of immediate housing.","LinkVolunteer":"https://hillcrestkc.volunteermatters.org/project-catalog","LinkWebsite":"http://www.hillcrestkc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/C77IUGS5S7Q8/ref=hz_ls_biz_ex","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/272.jpg","City":"Kansas City","State":"KS","Lat":39.0260009765625,"Lng":-94.5},{"Id":273,"Name":"Embrace Your Shine ","Address":"4611 E. 11th ST ","ZipCode":"64127","Phone":"9133135587","Email":"info@embraceyourshine.org","ContactName":"Rosana Polanco ","Mission":"To support future business owners, entrepreneurs , and career driven young adults. By creating steeping stones of opportunity for personal and professional growth for those striving to turn their passion into a profession while facing hidden homelessness. ","Description":"Creating transitional small homes in a cottage setting, to empower these future leaders by offering stability and support to transform struggles into success stories, cultivating the talent our communities truly need. \nOur small homes are NOT just residences, they are spaces for Growth, Ambition and Self-Discovery. ","LinkVolunteer":"working on creating one ","LinkWebsite":"https://embraceyourshine.org ","LinkWishlist":"working on creating one ","Pickup":true,"Dropoff":false,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/273.png","City":"kansas city","State":"MO","Lat":39.099300384521484,"Lng":-94.52749633789062},{"Id":274,"Name":"Raytown Emergency Assistance Program","Address":"9300 E. 75th St","ZipCode":"64138","Phone":"8163560054","Email":"whitney@raytownreap.org","ContactName":"Whitney Dantzler","Mission":"\u0022To consistently deliver our emergency services; making the clients dignity, self esteem and stabilization a top priority.\u0022","Description":"Raytown Emergency Assistance Program, REAP, is a non-profit organization serving the residents of the Raytown C-2 School District. Since its beginning REAP has been dedicated to serving individuals residing in the Raytown C – 2 School District, providing those who qualify with a wide array of services. They range from food, rent, and utility assistance to education – budgeting, computers, job search and readiness and other skills that will help the clients overcome the obstacles they are facing.","LinkVolunteer":"https://raytownreap.org/volunteer/","LinkWebsite":"https://www.raytownreap.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/274.jpg","City":"Raytown","State":"MO","Lat":38.98789978027344,"Lng":-94.47250366210938},{"Id":276,"Name":"Ruffles and Paws Pet Pantry INC","Address":"7534 Garnett St Apt 12","ZipCode":"66214","Phone":"4135393708","Email":"ruslancattle@outlook.com","ContactName":"Ruslan Angell","Mission":"To keep pets and families together thru food and supplies","Description":"Na","LinkVolunteer":"","LinkWebsite":"","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/276.png","City":"Shawnee","State":"KS","Lat":38.9911003112793,"Lng":-94.72319793701172},{"Id":277,"Name":"Morning Glory Ministries","Address":"416 West 12th Street","ZipCode":"64105","Phone":"7199634284","Email":"mgmkcmo@gmail.com","ContactName":"John Kraus","Mission":"Loving \u0026 Serving the Unhoused of Kansas City","Description":"Morning Glory operates a breakfast soup kitchen and emergency assistance center in downtown Kansas City, MO.   Breakfast is served to approximately 200 guests M-F 6:30-8am.  Emergency Assistance distributes clothes, hygiene, coats, sleeping bags, backpacks, and sundry items, plus helps guests obtain their birth certificate and MO state ID enabling them to apply for housing, employment, and government assistance.  ","LinkVolunteer":"https://www.signupgenius.com/go/9040845adab23a3f49-morning2#/","LinkWebsite":"https://morningglorykc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/2MY8ED3Z1LPJK/ref=hz_ls_biz_ex?","Pickup":true,"Dropoff":false,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/277.png","City":"Kansas City","State":"MO","Lat":39.03099822998047,"Lng":-94.5},{"Id":278,"Name":"A Hand up Resources And Community Outreach","Address":"7344 NW Rhodes","ZipCode":"64152","Phone":"8163926921","Email":"info@empoweredhands.org","ContactName":"Michelle Williams","Mission":"Hand Up Resources and Community Outreach mission addresses critical gaps in support systems for underserved communities, particularly those facing issues such as Seniors and Veterans housing, mental health, child poverty, and opioid addictions to name a few. ","Description":"Hand Up Resources and Community Outreach mission addresses critical gaps in support systems for underserved communities, particularly those facing issues such as Seniors and Veterans housing, mental health, child poverty, and opioid addictions to name a few. The primary problem we solve is the limited access to resources and education that individuals and families in these communities encounter. This lack of access results in a vicious cycle of disadvantage, where temporary fixes are mistaken for solutions. Unlike traditional methods that often consider help as merely a handout, our approach focuses on education and empowerment, equipping community members with the knowledge and skills necessary to uplift themselves and foster sustainable growth,","LinkVolunteer":"","LinkWebsite":"https://empoweredhands.org","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/278.png","City":"Kansas city","State":"MO","Lat":39.03200149536133,"Lng":-94.5},{"Id":281,"Name":"Mimi\u0027s Pantry 4 Kids","Address":"3715 N Oak Trafficway","ZipCode":"64116","Phone":"8167350220","Email":"m4kidsinfo@mimispantrykc.org","ContactName":"Julie North","Mission":"Our mission is to bridge the gap for individuals and families who are faced with the challenges of having enough nourishing food and educational resources available to them.","Description":" At Mimi\u0027s Pantry 4 Kids, we offer a supplemental pantry where kids can shop for hygiene products, school supplies and snacks year round.  We provide a learning center space where kids can take unlimited and free educational and enrichment classes, such as story \u002B craft hour, art classes, gardening classes, STEM related courses, and more!    Families receive free learning resources, books, and toys.  We offer yearly giveaways such as backpacks, new coats,  beach towels \u0026 sunscreen, and our Christmas Angels program.","LinkVolunteer":"https://www.mimispantrykc.org/volunteer/","LinkWebsite":"https://www.mimispantrykc.org/","LinkWishlist":"https://a.co/e9Are85","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/281.png","City":"Kansas City","State":"MO","Lat":39.16120147705078,"Lng":-94.57640075683594},{"Id":282,"Name":"Mahogany Real Estate Investments \u0022Investing in Youth \u0026 Community\u0022","Address":"5705 Wabash Ave","ZipCode":"64130","Phone":"8162694342","Email":"ruby.watson@m-rei.org","ContactName":"Ruby Watson","Mission":"Mahogany Real Estate Investments mission is to provide homeless students and aged-out foster children a safe transitional housing alternative, teach a multitude of skills to empower them to become self-sufficient, and facilitate the possible college prep, job training and vocational training.","Description":"At Mahogany Real Estate Investments, we believe in treating everyone with dignity and respect, regardless of their circumstances. We are committed to being a welcoming and inclusive organization that serves at-risk unaccompanied youth attending school and aged-out foster children.  We also believe in  integrity, commitment, trust, diversity, competence, accountability, teamwork, confidentiality and work ethics. \n\n","LinkVolunteer":"","LinkWebsite":"https://m-rei.org/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com/charities/282.png","City":"Kansas City","State":"MO","Lat":39.022701263427734,"Lng":-94.5562973022461},{"Id":283,"Name":"The Micah Ministry","Address":"606 Gladstone Ave.","ZipCode":"64124","Phone":"8162310016","Email":"office@ibcckc.org","ContactName":"Office Administrator","Mission":"We want people to experience the love, healing, hope, and beloved community described in Jesus’ first sermon where there is good news for the poor, freedom for the oppressed, sight for the blind, release for the captives, and the jubilee year of the Lord where nothing stands between anyone and their","Description":"We provide a warm meal (cooked in our facility by volunteers), clothing items (adults and kids), hygiene items (adults and kids), pet food, books, calendars, and notebooks for the houseless and food insecure population in Northeast Kansas City, MO. We also partner with other organizations to provide care in other ways for our neighbors, such as free medical care, college scholarship sign-ups, job training, food stamps, etc.","LinkVolunteer":"https://www.jotform.com/intersectkc/mondayvolunteer","LinkWebsite":"https://www.ibcckc.org","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/39T7BTJSIGQ8A?ref_=wl_share","Pickup":false,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/283.png","City":"Kansas City","State":"MO","Lat":39.03499984741211,"Lng":-94.5},{"Id":284,"Name":"Preferred Family Healthcare","Address":"8333 E Blue Pkwy","ZipCode":"64133","Phone":"8164747677","Email":"brooke.benton@pfh.org","ContactName":"Brooke Benton","Mission":"Our Mission\nPreferred Family Healthcare is a dynamic and caring organization committed to providing integrated care to assist individuals in achieving overall health and wellness.","Description":"My name is Brooke Benton and I am the clinical supervisor at a co-ed adolescent (ages 13-17) substance use residential treatment facility. \nWe are in need of donations for our client\u0027s store here at our facility. \nClients have the opportunity to earn items out of the client store as a reward for their sobriety and displaying acts of excellent behavior. This rewards system has been an essential part of our program in helping clients engage in treatment and remain sober!  \nWe are hoping for donations of: \n\n\u0022Quick\u0022 food items: \nRamen Noodles, Mac and Cheese Cups, chips, candy, Little Debbie cakes, Gatorades, sugar-free soda\nAge Appropriate Toys: \nFidget toys, stickers, gum ball machines, lava lamps, squishmallows, craft kits, art sets, etc. \nSelf-Care Items: \nBlankets, body sprays for boys and girls, face masks, lotions, fuzzy socks, jewelry, cool water cups/ water bottles, nails, makeup, etc.  \nWe are happy to accept any donations that anyone is able to provide for our clients! \n\nThank you so much for your consideration. ","LinkVolunteer":"","LinkWebsite":"https://pfh.org/","LinkWishlist":"https://www.amazon.com/cart?ref_=sw_gtc","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/284.jpg","City":"Kansas City","State":"MO","Lat":39.007999420166016,"Lng":-94.48919677734375},{"Id":285,"Name":"Cornerstones of Care","Address":"8150 Wornall Rd KCMO","ZipCode":"64114","Phone":"9132424284","Email":"lea.loudon@cornerstonesofcare.org","ContactName":"Lea Loudon","Mission":"Partnering for safe and healthy communities. ","Description":"Cornerstones of Care is a behavioral and mental health nonprofit dedicated to partnering with children and families to build safe and healthy communities. For more than 150 years, our passionate team members have been creating safe healing spaces for those impacted by trauma in Kansas, Missouri, and beyond. Our trauma-informed work is focuses on three key service areas: youth and family support, foster care and adoption, education and training.  ","LinkVolunteer":"https://www.cornerstonesofcare.org/get-involved/volunteer/","LinkWebsite":"https://www.cornerstonesofcare.org/","LinkWishlist":"https://www.amazon.com/hz/wishlist/ls/3UVTPCRN80Z6A?ref_=wl_share","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/285.png","City":"Kansas City","State":"MO","Lat":38.97990036010742,"Lng":-94.59600067138672},{"Id":288,"Name":"Starfish Project Foundation","Address":"1078 W Santa Fe, Suite A","ZipCode":"66061","Phone":"9138398567","Email":"contactus@starfishproject21.org","ContactName":"Joni Moreland","Mission":"We are needs based organization and our community dictates what those needs. Our mission is to provide a safe central point where the community can come together to inspire, empower, and serve their community, while preserving life sustaining resources from our city’s landfills.","Description":"We are the community coming together to serve the community.","LinkVolunteer":"https://starfishproject21.org/opportunities/","LinkWebsite":"https://starfishproject21.org/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/288.png","City":"Olathe","State":"KS","Lat":38.8848991394043,"Lng":-94.83290100097656},{"Id":289,"Name":"Story Boutique","Address":"95th Street \u0026 Mission Road","ZipCode":"66206","Phone":"9136422292","Email":"storyb@KCHospice.org","ContactName":"Karen VanAsdale","Mission":"Our mission is to bring expert care, peace of mind, comfort, guidance, and hope to people who are affected by serious illness or by grief. ","Description":"Kansas City Hospice \u0026 Palliative Care (KCH) is one of the oldest and largest nonprofit hospice and grief support providers in the Kansas City area. Founded in 1980, KCH has thoughtfully responded to community needs surrounding end-of-life as they have arisen, expanding into the comprehensive system of programs and services we offer today. Annually, we serve over 5,500 individuals and their families. Our compassionate caregivers have the unique honor of being an intimate support to families, their children and friends, during the important period of time at the end of someone’s life and through the grieving and healing process.\n\nKCH is a 501(c)3 nonprofit, locally owned and operated right here in Kansas City, overseen by a 21-member Board of Directors and President \u0026 CEO, David Wiley. KCH serves families and individuals living in 12 Kansas City metro counties: Johnson, Leavenworth, Douglas, Miami and Wyandotte in Kansas; and Cass, Clay, Clinton, Jackson, Lafayette, Platte and Ray in Missouri.","LinkVolunteer":"https://kchospice.org/volunteer/","LinkWebsite":"https://kchospice.org/story/","LinkWishlist":"","Pickup":false,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/289.jpg","City":"Leawood","State":"KS","Lat":38.95690155029297,"Lng":-94.63040161132812},{"Id":290,"Name":"Heart \u0026 Soul - A Story Bazaar","Address":"12904 State Line Road","ZipCode":"66209","Phone":"8163632600","Email":"KCHHeartandSoul@KCHospice.org","ContactName":"Mary Zahner Bauer","Mission":"Our mission is to bring expert care, peace of mind, comfort, guidance, and hope to people who are affected by serious illness or by grief. ","Description":"Kansas City Hospice \u0026 Palliative Care (KCH) is one of the oldest and largest nonprofit hospice and grief support providers in the Kansas City area. Founded in 1980, KCH has thoughtfully responded to community needs surrounding end-of-life as they have arisen, expanding into the comprehensive system of programs and services we offer today. Annually, we serve over 5,500 individuals and their families. Our compassionate caregivers have the unique honor of being an intimate support to families, their children and friends, during the important period of time at the end of someone’s life and through the grieving and healing process.\n\nKCH is a 501(c)3 nonprofit, locally owned and operated right here in Kansas City, overseen by a 21-member Board of Directors and President \u0026 CEO, David Wiley. KCH serves families and individuals living in 12 Kansas City metro counties: Johnson, Leavenworth, Douglas, Miami and Wyandotte in Kansas; and Cass, Clay, Clinton, Jackson, Lafayette, Platte and Ray in Missouri.","LinkVolunteer":"https://kchospice.org/volunteer/","LinkWebsite":"https://kchospice.org/heartandsoul/","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/290.png","City":"Leawood","State":"KS","Lat":38.8921012878418,"Lng":-94.60919952392578},{"Id":292,"Name":"MY REGION WINS!","Address":"7324 Norton Ave.","ZipCode":"64132","Phone":"8167144467","Email":"info@myregionwins.org","ContactName":"Carl Stafford","Mission":"We nurture ideas that spark real societal change—for a more inclusive and sustainable future for everyone.","Description":"OUR VISION: We’re building a future where creativity thrives, sustainability is the standard, and people feel deeply connected—to their purpose and each other.\nOUR SERVICES: We champion creators, activists, and visionaries who are ready to build something real. Whether you\u0027re a neighborhood leader, artist, environmentalist or changemaker with a purpose, we offer tools, networks, and coaching to best help you pursue your dream.  WE ‘HABILITATE’ DREAMS \u0026 NURTURE GREATNESS! Assisting companies in supporting their employees aspirational goals and dreams.\nOUR INITIATIVES: We\u0027re addressing social (and environmental) issues by demonstrating good practices.","LinkVolunteer":"https://myregionwins.org/engage","LinkWebsite":"https://myregionwins.org/home","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":true,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/292.jpg","City":"Kansas CIty","State":"MO","Lat":38.992801666259766,"Lng":-94.53990173339844},{"Id":293,"Name":"Heart n Hand Ministries","Address":"200 B St","ZipCode":"64012","Phone":"8163221133","Email":"danielle@heartnhand.org","ContactName":"Danielle Marley","Mission":"To come alongside people experiencing the adversity of poverty and provide resources and services that instill hope, encourage agency, and give people tools to build flourishing lives.","Description":"Our Vision\nTo embody the love of Christ by fostering a community of dignity and hope utilizing a trauma-informed, strength based, individualized approach to help people navigate their road map to employment, housing, and health. Our cumulative goal is to increase the quality of life for the  community and pass on a legacy infused with hope and opportunity for successive generations.","LinkVolunteer":"https://www.heartnhand.org/programs.html","LinkWebsite":"https://www.heartnhand.org","LinkWishlist":"https://a.co/eIOtJ0p","Pickup":true,"Dropoff":true,"Resell":false,"Faith":true,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/293.png","City":"Belton, MO","State":"MO","Lat":39.042999267578125,"Lng":-94.5},{"Id":294,"Name":"Rise and Shine Foundation, Inc","Address":"4440 Troost Ave","ZipCode":"64110","Phone":"8009888753","Email":"info@riseandshinefoundation.org","ContactName":"Catrina Peebles","Mission":"At Rise and Shine Foundation Inc, we serve women and men in crisis. Individuals facing the toughest moments of their lives-- often alone, without stable housing, resources, or support. Our programs are designed to meet the needs of those who are ready to rebuild themselves, reclaim their lives, and ","Description":"We provide support for:\nIndividuals experiencing homelessness: Including those displaced by poverty, trauma, or unsafe environments\nMen and women recovering from substance use disorder (SUD): Who are seeking a stable, supportive environment to maintain sobriety\nSurvivors of domestic violence: Offering them a safe space to heal emotionally and physically\nFormerly incarcerated individuals: Transitioning back into the community and working to create new, purposeful paths.\nPeople managing mental health challenges: Such as anxiety, PTSD, or depression who need compassionate, wraparound support.\nThose facing multiple barriers to stability: Including unemployment, lack of education, and limited access to healthcare or safe housing.\n​We are committed to:\nCreating a holistic, healing-centered environment where each individual—regardless of gender or background receives the guidance, housing, and services they need to move forward with dignity, strength, and hope. At Rise and Shine Foundation Inc, no one is defined by their past. We are here to walk beside you, toward a future of healing, purpose, and lasting change.","LinkVolunteer":"https://www.riseandshinefoundation.org/contact-us.html","LinkWebsite":"https://www.riseandshinefoundation.org","LinkWishlist":"","Pickup":true,"Dropoff":true,"Resell":true,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/294.jpg","City":"Kansas City","State":"MO","Lat":39.04570007324219,"Lng":-94.5730972290039},{"Id":295,"Name":"Sidney and Mike\u0027s Angels ","Address":"709 Belmont Ave","ZipCode":"64125","Phone":"8162557804","Email":"Sidneyandmikesangels@gmail.com","ContactName":"Teresa A Pennington","Mission":"We strive to reach the houseless community.  In feeding,  clothing them and getting them what they need to survive on the streets.","Description":"We  service the houseless community in kansas city mo. Every Sunday at Ilus Davis park  on 9th and locust.  We provide over the counter medicine, hygiene, clothes,  blankets, towels,  tents , tarps, shoes, snacks, water and whatever kind of food donations we get.  ","LinkVolunteer":"","LinkWebsite":"https://sidneyandmikesangels.org/","LinkWishlist":"https://www.amazon.com/registries/gl/guest-view/1HMXDXYN9GJTD?ref_=cm_sw_r_mwn_ggr-subnav-share_ET7QENH4SGBM7TCVG5RH\u0026language=en-US","Pickup":true,"Dropoff":true,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/295.jpg","City":"kansas city","State":"MO","Lat":39.10329818725586,"Lng":-94.50920104980469},{"Id":297,"Name":"Sandwiched KC","Address":"","ZipCode":"64052","Phone":"8164729178","Email":"rachel@sandwichedkc.com","ContactName":"Rachel Hiles","Mission":"The mission of Sandwiched KC is to create opportunities for family caregivers to find local support and shared wisdom.","Description":"We are a 501c3 nonprofit helping family caregivers in the Kansas City metro area by providing FREE information and referral, support groups, education, and self-care activities.","LinkVolunteer":"","LinkWebsite":"https://sandwichedkc.com","LinkWishlist":"","Pickup":true,"Dropoff":false,"Resell":false,"Faith":false,"GoodItems":false,"NewItems":false,"LogoUrl":"https://reusefullimages.s3.us-east-2.amazonaws.com//charities/297.png","City":"Independence","State":"MO","Lat":0,"Lng":0}]
